[
    {
        "name": "LEGO Watch(Model: 9002137)",
        "ratings": {
            "5 star": "77%",
            "4 star": "17%",
            "3 star": "4%",
            "2 star": "1%",
            "1 star": "1%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Bought this for my coworker. She loved it! It wasn't as small as I thought. In comparison to to my magic bullet with it sitting down, it's still bigger than my magic bullet base.",
                "review_posted_date": "13 Feb 2015",
                "review_header": "She loved it! It wasn't as small as I thought",
                "review_rating": "5.0 ",
                "review_author": "HM"
            },
            {
                "review_comment_count": "",
                "review_text": "This product looks so good in my bedroom!!! However, I consider that the product can be improved in several details. Suggestions: 1. I think the alarm sound of the alarm clock could be changed by a selection of sounds topics (minimum 5) of the film \"Star Wars\". 2. The lighting time to set the alarm time and the time could be extended from 5 to 10 seconds.",
                "review_posted_date": "08 Jun 2016",
                "review_header": "This product looks so good in my bedroom",
                "review_rating": "4.0 ",
                "review_author": "Mario Alb. Chacon"
            },
            {
                "review_comment_count": "",
                "review_text": "Easy to use and adorable. We got this Stormtrooper alarm clock for our seven-year-old son. It is very easy to set up, unlike many alarm clocks. It has a digital screen which is not lit up at night but it lights up easily if you push down on the Stormtrooper's helmet. When the alarm goes off it makes a beeping noise which increases in speed until it eventually turns off on its own. If you want to turn it off sooner you simply push on the helmet and it stops. I think this is a great alarm clock for kids.",
                "review_posted_date": "29 Dec 2016",
                "review_header": "Easy to use and adorable",
                "review_rating": "5.0 ",
                "review_author": "Movielovinmom"
            },
            {
                "review_comment_count": "",
                "review_text": "It's very cool looking. I must admit that I wish the alarm was more interesting than the standard annoying buzzer. Can we get some Star Wars music? It seems made okay but I question how well it will hold up. You hit his head to snooze it (which of course makes kids just want to hit the head as this also lights up the display).",
                "review_posted_date": "15 May 2018",
                "review_header": "Cute for a Star Wars Fan",
                "review_rating": "5.0 ",
                "review_author": "M_C"
            },
            {
                "review_comment_count": "",
                "review_text": "The clock is as described and my son loves using it. It's easy for him to operate (he's 7) but the back light/snooze function does not work very well. I don't know if it's just the one we received but you have to press the head 5-8 times to get it to work. In a way it's good because he can't snooze it and go back to sleep but he also can't check the time when he wakes up in the middle of the night. Wasn't worth returning and waiting for a new one so we are just dealing with not having those functions easy to use.",
                "review_posted_date": "02 Apr 2018",
                "review_header": "Back light/Snooze doesn't work well",
                "review_rating": "4.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "Coolest clock ever. My 3-yr-old son LOVES it! He was having a hard time getting up for preschool, so we got him this clock. The first day we put it in his room, he got up right when the alarm sounded. And he was so proud of himself knowing how to turn it off like a \"big boy.\" It is easy to use and read. Great purchase!",
                "review_posted_date": "30 Jan 2017",
                "review_header": "Fantastic, Simple Alarm Clock!",
                "review_rating": "5.0 ",
                "review_author": "Jenna A. Robinson"
            },
            {
                "review_comment_count": "",
                "review_text": "Well, we have already the Darth Vader version, so going for the storm trooper was our next step. The clock is of good size and has alarm that you can snooze by pressing the head. It has a lighted display that you activates again by pressing the head. It uses batteries, you can move the arms and legs. Its a really good item for any in love with star wars",
                "review_posted_date": "07 Feb 2017",
                "review_header": "Love star wars",
                "review_rating": "5.0 ",
                "review_author": "Nadasabe"
            },
            {
                "review_comment_count": "",
                "review_text": "My nephew loved this and wanted to use it Christmas night in his room. I would say this is best as a fun novelty item. He is 6 and is not likely to actually use an alarm clock at his age. Seems well made and the arms and legs are movable. The screen lights up when you press down on the head. Altogether a fun item and a great introduction into using an alarm clock!",
                "review_posted_date": "29 Dec 2017",
                "review_header": "great fun item",
                "review_rating": "5.0 ",
                "review_author": "NR"
            }
        ],
        "url": "http://www.amazon.com/dp/B004F12Y54\n"
    },
    {
        "name": "LEGO MINDSTORMS EV3 31313 Robot Kit with Remote Control for Kids, Educational STEM Toy for Programming and Learning How to Code (601 pieces)",
        "price": "$349.95",
        "ratings": {
            "5 star": "76%",
            "4 star": "13%",
            "3 star": "4%",
            "2 star": "3%",
            "1 star": "4%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "We have a ton of Lego kits so we are already Lego fans in my household. After you built enough Castles, Pirate ships and Fortresses, the models either get put away or they collect dust. I bought a used Mindstorms RCX kit used, 8 or 9 years ago and it was too much of a hassle with the IR tower and a working computer with Windows XP. My older son really was not interested in it after working with the NXT at School as part of a Robotics team. He was one of the main people on the team that understood how to make it work at crunch time in the competition, but Robotics was too nerdy for him. This Christmas I picked up the EV3 for my younger son. He was on the Vex team as a 6th grade student last year. I was hoping to do more on our own since the VEX team is not together this year. As aside note, I participated as a parent in the FLL with when my older son was in middle school and we made the trip with his team to compete at LegoLand. Last year I went to a Vex Tournament and I thought FLL was better at the middle school age group. The format was better and the kids really took pride being able to compete at LegoLand. Back to now - My son quickly built a couple robots that are on shown on the box and the kit got shelved till last week; we have many competing activities so finding projects that would capture his interest was the goal. We found the Mindcub3r Rubik's Cube Solver Robot. This one project really was fun and got my son really interested in the kit again. For us, the project was a medium difficulty level build. It used only pieces from the 31313 kit. Everyone who has seen this Robot is amazed and he was asked to bring it to school. Go to home depot and buy a large parts bin organizer or maybe even the DeWalt DWST14825 here on Amazon might work. It is easier to keep all the lego parts sorted and together. Before you buy any parts bin organizer you just have to make sure there a compartment that will fit the EV3 computer. You really need to go online and look for other projects and information as what comes in the box is good, but limited. We purchased \"The LEGO MINDSTORMS EV3 Discovery Book\" and my son is already excited to take apart the Rubik's Cube Robot we built and start working on the workbook. Both the Rubik's Cube Bot and the projects in the workbook only need the 31313 kit. $350 might seem like a good chunk of change to put down on something like this, they resell well on eBay if it does not catch on with your kids, but I think as a parent you have to get involved too. I recommend getting the workbook with the kit. I have been looking through the woorkbook and it has some good information and good teaching moments. We are starting the workbook projects tomorrow, so I will update this review in the future.",
                "review_posted_date": "27 Jan 2017",
                "review_header": "Great Kit with Huge Learning Opportunity",
                "review_rating": "5.0 ",
                "review_author": "T. Mackel"
            },
            {
                "review_comment_count": "",
                "review_text": "I have waited for two years to write this review. There's a good reason for it. I first bought these as a Christmas gift for my son when he was nine/fourth grade. The reason was that we had sent him to a day camp for a week that same year, and this was what they were using. EDIT: I did not know at the time that there was a difference in the \"retail\" vs. \"educational\" kits, and my son was getting frustrated over some of the things that he could not get the mindstorms to do that he could do at camp. If you get/got these after a Lego robotics camp, it's important to keep that in mind. END EDIT. He was initially ecstatic about them. He and my husband built a few things, and although my son is really focused on science and math, trying to build something on his own was intimidating for him. He didn't really want to build anything unless my husband could guide him. That wasn't what we were going for - my husband is a great dad and spends a lot of time with our son, but our goal was for my son to use his imagination and start creating things himself. We installed the software on my laptop, but as I was working from home at the time, that situation led to issues with trying to get things to work. I found myself really resenting that I shelled out SO much money for toys that were just sitting there. We would find ourselves saying, \"Why don't you go do something with your mindstorms?\" and he'd look at us like he was being punished. Over the course of the next year, he would build a few things, but only sporadically. Fast forward to sixth grade/age 11. He's matured a bit (as much as one can expect of an 11-year-old). But I mean he's got more initiative and can create things without feeling the need to have dad with him. He does have a low-end smartphone, and we said he should get the mindstorms app so he doesn't have to rely on my laptop. He's creating all kinds of things, sending them into the living room to show us while he's in his room. I think that even for a kid who was so geared toward things like this at age nine, he needed more time to really get into these. He's never been one to just build a lego set and keep it that way; he always pulls them apart to create things on his own, and those are usually pretty cool. I guess I thought that he would have been the same way with these, but perhaps the mindstorms were a little overwhelming. I'm not really sure, but I think my tip for anyone is that if their kid doesn't fully get into these right away, give it time. My son is actually using these as part of his science fair project this year.",
                "review_posted_date": "22 Oct 2015",
                "review_header": "Might be intimidating/overwhelming for some younger kids, but mine is finally into mindstorms.",
                "review_rating": "4.0 ",
                "review_author": "dani"
            }
        ],
        "url": "http://www.amazon.com/dp/B00CWER3XY\n"
    },
    {
        "name": "LEGO Ideas Exo Suit 21109",
        "price": "$49.99",
        "ratings": {
            "5 star": "84%",
            "4 star": "12%",
            "3 star": "3%",
            "2 star": "1%",
            "1 star": "0%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "This is just so much fun on so many levels. The unique, green semi-classic space figures delightfully accent the set. They provide just enough color to breathe life into the monochrome mech, without spoiling its complex but utilitarian ruggedness. The traditional space logos and 2nd generation helmets with flip-up visors are a welcome bit of nostalgia, and in brand new vibrant green! The pictures of the Exo Suit and turtle on the box look completely light/dark gray, however some of those elements are actually silvered pieces, which enhance the metallic theme. As mentioned in several reviews here, the build is somewhat intricate, making use of mainly small parts. Often in clever and surprising ways. It was not tedious to put together, and didn't take long. But the build is different than your typical set. For example, the largest pieces in the suit are a 2x6 plate, followed by a 2x4 plate -- and only one of each! Even the ball and socket joints use only short segments, with the arms and legs built up from axles and linkages. The finished model has excellent articulation and posability. Particularly the hands and legs. Also, LEGO has consistently provided extras of the smallest, easiest to lose pieces. Which seems to be most of this set! I had around a dozen extra parts, from rounds to flats to wrenches to spikes to a spacesuit tank and visor. Even still, they have a customer service contact and a complete part listing at the end of the manual, just in case. The instruction book and short story are another nice touch, as usual in several languages. The only drawback was the insets naming some sections of the exosuit seemed to be out of order or on the wrong pages. The instructions were clear and fine, just the annotation seemed to be out of place (wrong page refs in the source file?). Very minor distraction. And in no way diminishes from the sheer awesomeness of this LEGO Ideas set. I hope to see many more of this caliber produced over the coming decades. Finally, I appreciated the sales pitch text saying the design was modular, and encouraged tuning it to your mission. This kind of thinking embodies the creative spirit of LEGO, and the sharing and tweaking and expanding the ideas of others. Thanks for making this set available at a reasonable price for the piece count. And special thanks to the designer (Peter Reid) for doing the work and getting this out there. I'll have to check out your LEGO Space book! (Though a note of caution: When I finished building the Exo Suit, Yve jumped into the cockpit to test it out. Pete grabbed the walkie talkie. He's only scowling because he's trying to sweet talk his way out of the dexterous but gentle grip of an expertly wielded Exo Suit claw... She's grinning ear to ear...) Thanks and happy building.",
                "review_posted_date": "11 Jan 2017",
                "review_header": "Fun classic but modern space set, and sweet to have it come from LEGO Ideas",
                "review_rating": "5.0 ",
                "review_author": "Not a Number"
            },
            {
                "review_comment_count": "",
                "review_text": "I am so glad I bought this set. This model has reawakened my inner child. The build is fun & challenging. It uses more technic parts instead of traditional lego bricks so it may be harder for younger kids to build. The finished product is highly posable and fun to look at. It comes with 2 classic space mini figures and a robot turtle (also very cool). Buy it before it retires!",
                "review_posted_date": "11 Apr 2015",
                "review_header": "One of the best lego sets I ever bought.",
                "review_rating": "5.0 ",
                "review_author": "tatertots"
            },
            {
                "review_comment_count": "",
                "review_text": "My son asked for this set for his 10th birthday and is really, really happy with it. He is always building robotic dinosaurs and \"mechs\" using similar techniques, so when he saw this Exo Suit he was so excited. It took him about an hour to build, maybe less (hard to tell because he had to keep stopping for silly things like dinner, homework, and drum lessons), and he was easily able to complete it without any help. Even before he had it half built, he was going on and on about how cool it was. The finished model looks great and is easy to pose and balance standing up. It has a lot of interesting uses of different pieces in ways you might not normally build with, so it's fun that way. I can also see how using pieces in new ways can inspire kids to think creatively about their own projects. My son said he loved the way the legs of the Exo Suit were jointed \"like a lizard or dinosaur,\" and he noticed it even looks awesome from the back. The retro look of the astronauts (and one is a girl, yay Lego!) is a nice touch and the turtle/rover is just plain cute. Of course, the beauty of Lego is that you can adjust it to do your own thing. After playing with the finished set for a while, my son said he thought the arms were a bit too long and that the claws were \"too much.\" He then set about rebuilding them to suit his own taste, resulting in a suit with no claws, fewer fingers, and slightly shorter arms -- with a little help from Lego pieces in his own collection. I have no doubt this is a model that will be played with, displayed, and not taken apart to build something else.",
                "review_posted_date": "24 Feb 2015",
                "review_header": "Lego Ideas Exo Suit",
                "review_rating": "5.0 ",
                "review_author": "FlowerGirl16"
            },
            {
                "review_comment_count": "",
                "review_text": "I absolutely love this set! I really wish Lego would create for sets similar to this regarding exo-suits or robots. I purchased this set to create a Brickfilm using the exo-suit and a simple story line but this set has so much more to it. I've found a number of other configurations you can make with the pieces and its just so darn cool looking. I also like that you get two minifigs that are green space figures and not the generic red or blue. I can't recommend this set enough! My boys were fascinated with it and once I created a simple video using the set they were even more jazzed about it.",
                "review_posted_date": "21 Oct 2016",
                "review_header": "One of the coolest lego space sets you can buy! Hands down!",
                "review_rating": "5.0 ",
                "review_author": "kingspud"
            },
            {
                "review_comment_count": "",
                "review_text": "This only occupied my child for about 40 minutes. I primarily purchase Legos to alleviate the stress and responsibility of good parenting but this didn't provide nearly enough \"me\" time. Buy this product cuz as soon as lego stops making it then some middle aged lego nerd on amazon will charge $200 for it.",
                "review_posted_date": "27 Mar 2015",
                "review_header": "I primarily purchase Legos to alleviate the stress and responsibility of good parenting but this didn't provide nearly enough \"m",
                "review_rating": "5.0 ",
                "review_author": "Quam Bafu"
            },
            {
                "review_comment_count": "",
                "review_text": "This is a really incredible Lego set. It's smaller than its part count might suggest but it's shockingly poseable and looks truly impressive. Display value is through the roof. Play value is pretty high although there are some pieces that fall off pretty easily. It contains a lot of high value technic pieces that are sure to come in handy if you decide to disassemble. The green classic space minifigs are sure to hold their value. Like a lot of the new lego sets, this contains spares of a lot of the smaller pieces.",
                "review_posted_date": "01 Jan 2018",
                "review_header": "A steal at $35-ish",
                "review_rating": "5.0 ",
                "review_author": "EDG"
            },
            {
                "review_comment_count": "",
                "review_text": "Nice challenging kit with many small parts. Construction is mostly axles and pins rather than bricks. The finished model is very posable.",
                "review_posted_date": "18 Jul 2015",
                "review_header": "Nice challenging kit with many small parts",
                "review_rating": "5.0 ",
                "review_author": "Jasen"
            },
            {
                "review_comment_count": "",
                "review_text": "I love this set. Once built, you can articulate all the joints and pose the suit in nearly infinite configurations. The green minifig suits are a nice color along with the old-school space logo. The build was complex enough to keep me engaged, but not so difficult that it was frustrating. P.S. - the little turtle is super cute too!",
                "review_posted_date": "29 Nov 2017",
                "review_header": "Fun, posable build!",
                "review_rating": "5.0 ",
                "review_author": "Kristo K."
            }
        ],
        "url": "http://www.amazon.com/dp/B00L2DL6GG\n"
    },
    {
        "name": "LEGO Classic Large Creative Brick Box 10698",
        "price": "$47.99",
        "ratings": {
            "5 star": "86%",
            "4 star": "8%",
            "3 star": "4%",
            "2 star": "1%",
            "1 star": "1%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Lego classics are awesome! I am somewhat partial, I loved Legos as a child and these classics remind me of my Lego buckets. I'm guessing Lego responded to public demand for something other than a kit to build a specific item. Lego in general are educational, the kits have taught my 5 and 3 year old to follow directions without having to read and the larger kits have provided us with fun family time. This collection will inspire them to use their imagination to build whatever they please in whatever color they wish. I have attached two pictures to show how the bricks are bagged and the back paper of the exact bricks you will receive. Several windows, doors, baseplates, wheels, ramps, dots, building bricks, smooth finishing pieces - see picture for exact color and number of each piece. The yellow storage brick is also nice if you do not already have a place for your Legos. I am planning on using it as decor for their Lego themed bday party. If you are looking for other Lego storage options, ikea trofast drawer system was an inexpensive way to organize by color. If you are just getting introduced to Legos, do not expect it to be full once the bags are opened and dumped. You will receive 790 pieces and this retails for $60. At the Lego rule of 10 cents per Lego, this seems to be a great deal. This box full of Legos would be hundreds of dollars. Lego has been around for generations so there isn't a question of durability or craftsmanship. If you need an activity for your children, looking to add to an existing set, giving a gift for a Lego lover this set will be a perfect choice. Anyone who gets involved with Legos knows the obsession that follows to have more bricks, so just add on! I also recommend the classic bright set, that was a great purchase to add the \"girl\" colors to my boys collection of stereotypical boy colors. The classic medium set was ok, but I probably wouldn't purchase that again, I would get the bright set or this large box again.",
                "review_posted_date": "03 Feb 2015",
                "review_header": "Great supplement or starter set",
                "review_rating": "5.0 ",
                "review_author": "morganbaby"
            },
            {
                "review_comment_count": "",
                "review_text": "The picture is the biggest house I could build exclusively with ALL of the 4x2 bricks included in this set. As you can see, its just enough to be high enough to cover the minifigures head (not included), but there are not enough left to build a roof. Yes, you could finish the house with other pieces, but at this price, I should have enough 4x2's to build a reasonably sized house. 4x2 bricks are the workhorse of creative building with Lego, no matter how much LEGO has attempted to market smaller, more complex and specific creations as the 'new' heart of Lego, and not buildings and houses. Any child who grew up with Lego knows its *ALL* about the 4x2. This is a 790 piece set, with only *67* 4x2 bricks. On average, most colors only have FOUR 4x2 bricks - !? The 4x2 is relatively large and expensive, so Lego sells sets with really high piece count - like this one at 790 - but uses tiny pieces no one cares about to push up the piece count. In this case, only 8% of the pieces are 4x2's. ...and I love Lego's response to people's complaints about 4x2's - 'hey, come to our website and buy by the BRICK' - where 4x2 pieces are $.30/pc! I don't even think LEGO *wants* to sell these building sets anymore (this set was created 'by demand!'), because the vertical sales of endless expensive, complicated *model* sets of licensed characters (like its own, or Batman, Star Wars, etc) are much more lucrative. Most of these sets aren't even buildable by kids until they are competent readers who can follow complex instructions, and once they have built it, the bricks have little or no replayability. Build the model, you're done. Did I mention these model sets seem half the size of as the picture on the box? Some of Lego's model sets are completely phoned in as well - the original Minecraft sets, for example - uh, my kids and I have played ALOT of Minecraft - the original Minecraft sets - I don't even know what they were *supposed* to look like - they looked like a mess - and, of course, where Minecraft is a game of large 1 meter square blocks, the LEGO version was comprised of tons of the tiniest pieces I have ever seen. Once we opened the box, we didn't even bother building our Minecraft set, it was so disappointing. Having bought only one other model sets other than the Minecraft one, I don't even like my kids to see the model sets in the store - because yes, the cover art is exciting and cool, but I know that the out-of-the-box experience is not. Dad will wind up building the entire thing, my daughter will play with it for 5 minutes, start taking some pieces apart, and it will be nothing more than a mess of tiny toy pieces no one plays with for the rest of its lifespan. I have talked to other parents, and Lego's strategy is a universal disappointment. Lego, the 'CLASSIC' Lego experience is having a child open their first set of legos, which is mostly 4x2, so they can build big, beautiful buildings of their own imagination. You can sell your one-off model kits, but let's see you sell at least ONE set which is mostly 4x2, and bring that core experience of replayability back to kids of this generation. I chose this set because it does contain some parts I think are important for a core set - like windows, doors, and wheels - but when I see the vast number of tiny useless filler this set has, it just makes me upset about what kid's experience is with modern Lego marketing.",
                "review_posted_date": "05 Mar 2015",
                "review_header": "LEGO STOP SKIMPING ON 4x2 BRICKS!!!",
                "review_rating": "2.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "++ Observations: * The box isn't good as Lego storage -- a few pieces are small enough to fall through the hole on the bottom. I do advise buying a separate Lego organization solution. * The diversity of pieces is a little thoughtless, and there aren't enough basic pieces of any one color. I purchased an extra \"Lego Creative Supplement\" package, and still had trouble getting enough pieces for the wall and roof of the home. The kinds of pieces available to any color is also a little capricious. I wish they removed some of the colors and just gave more basic pieces. * The sole green base plate it comes with is small, and I'm surprised there isn't at least one more base plate. ++ Verdict: I wanted to take out my wallet and convert money into an ideal classic Lego introductory experience, but alas, this large classic box, even with a creative supplement, lacked the right quantity of basic pieces. I ended up going to the Lego website to buy large bundles of basic pieces in just a few basic colors, and the price was surprisingly reasonable.",
                "review_posted_date": "30 May 2017",
                "review_header": "Thoughtless diversity of pieces -- hard to build a home.",
                "review_rating": "3.0 ",
                "review_author": "Yosef Levi"
            },
            {
                "review_comment_count": "",
                "review_text": "I love legos. Now that my 8 year old is getting into them I thought this would make great bonding time, and it does.We have bonded in our frustration with what $55 dollars gets you. NOT MUCH! Sure there is almost 800 pieces but 70% are small insignificant pieces. The bucket size is very deceiving. It is about a quarter full. There aren't enough pieces to get super creative, let alone build a house. These are fun but IMHO Lego is getting too big for their britches. Not a great value.",
                "review_posted_date": "28 May 2016",
                "review_header": "almost enough for fun",
                "review_rating": "3.0 ",
                "review_author": "CHess"
            },
            {
                "review_comment_count": "",
                "review_text": "Box was very sturdy and all Legos were separated into bags by color. Easy to open plastic packaging and easy to see what parts each had inside. We got this for our son to add more blocks to his collection and it served the purpose it was intended for.",
                "review_posted_date": "27 Jul 2015",
                "review_header": "Great buy!",
                "review_rating": "5.0 ",
                "review_author": "Kindle Customer"
            }
        ],
        "url": "http://www.amazon.com/dp/B00NHQF6MG\n"
    },
    {
        "name": "LEGO Classic Medium Creative Brick Box 10696",
        "price": "$27.99",
        "ratings": {
            "5 star": "81%",
            "4 star": "11%",
            "3 star": "5%",
            "2 star": "2%",
            "1 star": "1%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "This set comes with a variety of 484 Legos. They are separated into bags and placed into this yellow plastic bin. Once you open the bags, it would probably take up one fifth of the bin. Do not think this bin is coming filled to the top, that would be hundreds of dollars. The bin itself would be great for storage if you needed. I am planning on saving it for their Lego themed birthday party to set up paper plates or silverware in. This is a classic set nostalgic to the bins I had as a child. I am a fan of Lego in general, I like their kits because they allow my 5 and 3 year old to create trains, cars, etc that look cool and are fun to play with. These classic kits allow for their Imaginationon to run wild as they dig in. This set came with 35 colors. I was happy with the assortment of pieces, some of the smooth finishing pieces, ramps, dot pieces, grated pieces. It had a selection of wheels and hubs, tiny size and medium. Without the tires you can create train wheels. There were several small black windows, without shutters or panes. And one tiny arch window that is pictured on the front. There's also the smooth dot eyeballs. This kit contained a few base plates, the largest was 8x16. Also a brick separator, which is really cool device so you don't have to use your teeth. Right now we are getting these classics sets to bulk up my kids collection for free building. I do like this medium set for the variety it contains. I have read that you shouldn't pay more than ten cents per Lego (accounting for differences in variety of sizes). This kit retails for $30, so with that little thought in mind it is a great price and variety. I also recommend the the $20 Lego classic bright box. It contained great colors, and didn't have wheels or windows- mostly building bricks. if you are just getting started with Legos- buy it. If you need a gift for a Lego lover- buy it. If you want to add on to your/your child's collection- buy it. Getting more Legos can never be wrong, especially when they build your child's imagination and keep them busy for hours!",
                "review_posted_date": "01 Feb 2015",
                "review_header": "great for a supplement or a starter set",
                "review_rating": "5.0 ",
                "review_author": "morganbaby"
            },
            {
                "review_comment_count": "",
                "review_text": "The Lego Creative (Medium) Creative set comes to in a nice plastic storage box. I knew what was included, so I cannot blame Lego. There are simply not enough basic bricks to build with. I have uploaded several pictures for your review. When all is said and done, you are left with a lot of extra room in your storage box. For us, this was okay, but if your little builder wants to build a house, you may want to check out the Lego Education Basic Brick Set. That set has a lot of building bricks. This set has more specialty pieces, such as wheels. Overall, a great quality product. Lego never disappoints in that regard. This set may disappoint you IF you don't realize exactly what you are getting. I think my pictures will help you there! As you can see, there aren't many basic bricks.",
                "review_posted_date": "28 Feb 2016",
                "review_header": "See Pictures! NOT Enough Classic Bricks...",
                "review_rating": "4.0 ",
                "review_author": "Olivia"
            },
            {
                "review_comment_count": "",
                "review_text": "I got this box of legos for my students to use during indoor recess. The container is sturdy which is great for how many students will be handling it. The lid attached sturdily. My only complaint is that the size of the box is very misleading. If you look at the photo I attached, the pieces it comes with barely even fills the container halfway. I still think it's a pretty good deal for the container plus the pieces. I guess it leaves room for me to fill with more lego pieces as I buy more.",
                "review_posted_date": "07 Apr 2017",
                "review_header": "Good product, one complaint....",
                "review_rating": "5.0 ",
                "review_author": "alewis1227"
            },
            {
                "review_comment_count": "",
                "review_text": "So in trying to give a \"chest full O' legos\" as a gift to a niece I discovered what I was aiming for would cost thousands of dollars if I bought it from lego. After scouring the internet for a weekend I settled on buying a ton of usa made, but CHEAP, not lego \"legos\" that were sold here on amazon and fit just fine with actual legos. I wound up finding 1000 mixed size building blocks for around 20 bucks. Through lego anything even close cost around or over 100 dollars and wouldn't have contained many actual building blocks. Finding anything sold by lego that had a good mix of building blocks and \"flavor\" or \"special\" connecting blocks, like axles and windows/doors, was impossible. It was mostly the special or flavor pieces and only ever a handful of proper building blocks. The only set that contained a majority of building blocks had somewhere around 1500 pieces but it cost over 150 bucks! In the end I bought this set solely as a \"special\" and \"flavor\" lego set. It gives you some axles, a door, and enough oddball and unique pieces that you can actually turn some building blocks into something other than just a tower. You can build a handful of things listed in a pamphlet that comes with it but after that the options are pretty limited without some real building blocks to throw into the mix. To sum up this is a great addition to a collection solely because there are not many other options out there that don't cost an arm and a leg and which also have as many unique pieces. Buy this and a couple of bags of cheap off brands and you've got a good start on a collection. Oh, and don't forget the extra large base boards!",
                "review_posted_date": "25 Mar 2018",
                "review_header": "not lego \"legos\" that were sold here on amazon and fit just fine with actual legos",
                "review_rating": "3.0 ",
                "review_author": "SmoothCrafts"
            },
            {
                "review_comment_count": "",
                "review_text": "I have objected to so many Lego kits because they are so specific. I miss the standard Lego bricks--the twos, fours, and eights of my childhood with a few windows and wheels--that didn't need instructions to make fun stuff: from the name of this, I thought that was what this one was however, this comes with lots of instructions. Sure, you can make cool stuff, but it still ties you to the plans rather than liberates you into the possibilities of undesigned construction. I would love to find a big box of basic lego bricks so I can make what I want, rather than what Lego wants me to make.",
                "review_posted_date": "17 Mar 2018",
                "review_header": "Not what I thought I was getting",
                "review_rating": "3.0 ",
                "review_author": "Keith E. Welsh"
            },
            {
                "review_comment_count": "",
                "review_text": "Significantly overpriced for what was in it. Not an assortment of LEGOs as the name \"Creative Brick Box\" would lead you to believe. It is actually just several small LEGO model projects, with specific pieces meant for that specific model and not the general 1x1, 1x2, 2x2, 2x4, and 2x8 pieces like I expected. Other than being overpriced for what you're getting, there is nothing inherently wrong with the product, just not what was expected from a box boasting the number of pieces and the creativity of it.",
                "review_posted_date": "07 Jul 2016",
                "review_header": "Not what was expected; overpriced.",
                "review_rating": "3.0 ",
                "review_author": "Connor"
            }
        ],
        "url": "http://www.amazon.com/dp/B00NHQFA1I\n"
    },
    {
        "name": "LEGO Creator Expert Volkswagen T1 Camper Van 10220 Construction Set",
        "price": "$119.95",
        "ratings": {
            "5 star": "88%",
            "4 star": "7%",
            "3 star": "2%",
            "2 star": "0%",
            "1 star": "3%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I continue to be amazed by the amazing engineering that goes into turning small little brics into a 4 pound object de art. Incredibly detailed, fun, amazingly designed, super fun and funky. Did have one missing piece - a black 1 x 2 that goes on the front passenger door - but I scarfed one from my Millennium Falcon (next build) and just received replacements (free and quickly) from LEGO who are great about this stuff. Built over four sessions (give or take)...maybe 16 hours? Detailed engine. Folding table and bench seats. Kitchen/sink. Closet with mirror. Hippie art. Therapy in a box. Makes the cares of the world go away and finishing it...there's still something amazing about finishing your LEGO. Millennium Falcon is next...followed by the dreaded Tower Bridge and Sydney Opera House. I've pretty much got my next year plotted out. Thank you LEGO. Miracle in a box...and cheaper than going to the shrink.",
                "review_posted_date": "13 Feb 2016",
                "review_header": "Cool and Groovy Therapy In A Box.",
                "review_rating": "5.0 ",
                "review_author": "George Evans"
            },
            {
                "review_comment_count": "",
                "review_text": "It was fun and I'm 11, it wasn't to hard, it was detailed and the directions were clear.",
                "review_posted_date": "25 Nov 2015",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "Bookworm"
            },
            {
                "review_comment_count": "",
                "review_text": "I purchased the retro VW camper van for my eleven year old grandson who loves all things camping vehicles as well as Legos. There are over 1300 pieces and the age range states 16+ but as he is meticulous at following the directions I thought he could handle it. He said it was \"by far the hardest one yet,\" however he completed it in a few days with marvelous results. And, unlike many of the small sets, the camper van is very large with intricate detailing. I have attached a photo of the result.",
                "review_posted_date": "12 Nov 2017",
                "review_header": "This is the greatest!",
                "review_rating": "5.0 ",
                "review_author": "Lucyjack"
            },
            {
                "review_comment_count": "",
                "review_text": "So much fun! I'm an adult LEGO collector and this is one of the most enjoyable sets I've experienced (second only to the original Arkham Asylum). So much detail and such intricate components to recreate a truly iconic vehicle of the era. The engine is just amazing. The roof vent with a fabric curtain, the closet with a reflecting mirror, the tiny shelves on the door, the lava lamp, and (my favorite part) the seat that collapses into a bed. The only downside is the fragility of the roof structure. If you're showing off your new structure to your friends, the roof could start shedding parts when you try to take it off, much to your chagrin. *ack* Also, as an aside, Hippie Lego minifigure pairs perfectly with this set. :)",
                "review_posted_date": "19 May 2017",
                "review_header": "Groovy!",
                "review_rating": "5.0 ",
                "review_author": "AlienHunter47"
            },
            {
                "review_comment_count": "",
                "review_text": "My 9-yr old has just finished building this. It's Expert-level, so it required quite a bit of time and patience to get it done, including a complete re-sort of all the pieces by color. But the finished van looks great, and she is very proud of her achievement.",
                "review_posted_date": "09 Jan 2016",
                "review_header": "Complex, but a great model",
                "review_rating": "5.0 ",
                "review_author": "Radu Gruian"
            },
            {
                "review_comment_count": "",
                "review_text": "Really a cool set! This is the my favorite Lego set until now. I have several other Star Wars sets, but I have to say they are not as good as this one, since this is a running car :). Maybe I will try some train sets in the future, if they are not very expensive... I will suggest buying this set from Lego official online store if you are not in a hurry. The price is similar (pre-tax), and you can earn VIP rewards, and get some free items there. Hope everyone enjoy it!",
                "review_posted_date": "15 Oct 2016",
                "review_header": "Great Lego Set",
                "review_rating": "5.0 ",
                "review_author": "frank"
            },
            {
                "review_comment_count": "",
                "review_text": "The build was not as intuitive as a many other builds (this might be a positive or negative depending on your perspective). The reduced stars are for missing pieces and a very fragile final build. The moving parts are very clever but also quite tenuously attached. Normally I build the sets and my daughter plays with them for quite a while before I have to rebuild anything. This started falling apart before I was even done.",
                "review_posted_date": "04 Jul 2018",
                "review_header": "Clever, but very fragile",
                "review_rating": "3.0 ",
                "review_author": "Elizabeth Carlson"
            },
            {
                "review_comment_count": "",
                "review_text": "My very first Lego build on my own! I had so much fun putting this kit together! It took me about 5 days total and, while my fingertips were pretty sore after all those tiny pieces, I had a blast with it! There is a \"loose\" organization to the pieces so even though the bags aren't numbered I kept each bag separate. It made finding pieces much easier.",
                "review_posted_date": "01 Aug 2017",
                "review_header": "Beep, beep! Vroom!",
                "review_rating": "5.0 ",
                "review_author": "rannalynn"
            }
        ],
        "url": "http://www.amazon.com/dp/B014QRO0W6\n"
    },
    {
        "name": "LEGO CITY Ambulance Plane 60116",
        "ratings": {
            "5 star": "89%",
            "4 star": "6%",
            "3 star": "1%",
            "2 star": "1%",
            "1 star": "3%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "This was a gift for my five year old grandson. What boy doesn't like Legos?? He put it together in no time and has thoroughly enjoyed playing with it.",
                "review_posted_date": "02 Jun 2016",
                "review_header": "What boy doesn't like Legos?",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "Kids like this, it has good instructions and holds together well. Classic Lego piece and good buy.",
                "review_posted_date": "05 Jun 2016",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "Gave this gift to my son and he enjoyed it! Do not regret and was cheaper than actual lego store. Looks exactly like the picture.",
                "review_posted_date": "19 Jan 2017",
                "review_header": "Fun!",
                "review_rating": "5.0 ",
                "review_author": "JUAN C."
            },
            {
                "review_comment_count": "",
                "review_text": "11 yr. Old son loves this as it is part of the CITY and he's got most of the houses and stores.",
                "review_posted_date": "01 May 2016",
                "review_header": "11 yr. Old son loves this as it is ...",
                "review_rating": "5.0 ",
                "review_author": "Butterflyin"
            },
            {
                "review_comment_count": "",
                "review_text": "Grandson loved it and it was not hard for him to put together. he wanted this for along time and the price was great compared to other places we looked.",
                "review_posted_date": "26 Oct 2016",
                "review_header": "Grandson loved it and it was not hard for him to ...",
                "review_rating": "5.0 ",
                "review_author": "Pleased"
            },
            {
                "review_comment_count": "",
                "review_text": "I bought this for one of my boys. They are really into the city sets. It was a big hit. It's a plane. Can't go wrong with a plane!",
                "review_posted_date": "21 Jul 2016",
                "review_header": "I bought this for one of my boys. They ...",
                "review_rating": "5.0 ",
                "review_author": "Jay Batman"
            },
            {
                "review_comment_count": "",
                "review_text": "Great Christmas gift for grandson- thrilled this was last year",
                "review_posted_date": "18 Nov 2018",
                "review_header": "Great Christmas gift",
                "review_rating": "5.0 ",
                "review_author": "Donna Blackman"
            },
            {
                "review_comment_count": "",
                "review_text": "One of the coolest lego sets I have purchased. My 5 year old loves this plane and plays with it all the time!",
                "review_posted_date": "02 Jun 2016",
                "review_header": "One of the coolest lego sets I have purchased. ...",
                "review_rating": "5.0 ",
                "review_author": "JKEAE31"
            }
        ],
        "url": "http://www.amazon.com/dp/B017B1ASE8\n"
    },
    {
        "name": "Brickyard Building Blocks Building Bricks - 1,100 Pieces Compatible Toys Bulk Block Set with 154 Roof Pieces, 2 Free Brick Separators, and Reusable Storage Box with Handle (1,100 pcs)",
        "ratings": {
            "5 star": "90%",
            "4 star": "8%",
            "3 star": "1%",
            "2 star": "1%",
            "1 star": "0%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I have bought hundreds of LEGO sets and have QA experience at a plastics plant, so I was very picky when I tested this product. I will buy more of this set for sure. I built identical buildings with lots of brick brands and this did better than LEGO! It was the only set I tested that came with a guarantee which was impressive as well. The sizes and shapes of bricks reflect wonderfully what kids actually NEED in order to build what they most often build. (LEGO was always very skewed toward small pieces with only 1 or 2 token large bricks per set.) By my calculation, this set had 29% more of the larger pieces than the equivalent LEGO set (discontinued) as well as plenty of the most valuable 2x2 and 2x4 pieces because most projects use this size of brick. This company is the only brand I tested that has a 2x2 plate piece which is something kids have asked me for year after year and LEGO never offered in their basic set. There are lots of large plates which are invaluable for cars, planes, and animals which are the first things most kids try to build. (I really wish there were enough wheels to make 2 or 3 cars because I always have to buy those separately and the color brown for things like trees, hair, and skin, but most beginning builders don't focus on color much so that is a minor detail.) The packaging was nice, with a parts list on the side which I love.",
                "review_posted_date": "23 Mar 2016",
                "review_header": "This set actually made more stable buildings than LEGO!",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "Let me start off by saying that nobody is paying me for this review nor did I get a discount on the product. I love these blocks. I bought my 4 yr old son legos for Christmas. The box only came with 484 legos and was $45. That's not many. He needed more but I couldn't afford lego brand. When I came across these for a fraction of the price I was skeptical, but after reading the positive reviews I gave it a go. I'm not disappointed, neither is he. They fit with the lego brand perfectly, they are great quality aND I will definitely buy more later as needed. Also this is the ONLY company that has ever emailed me just to be sure I'm satisfied. I am beyond satisfied. You will be too",
                "review_posted_date": "07 Jan 2017",
                "review_header": "Wonderful wonderful wonderful",
                "review_rating": "5.0 ",
                "review_author": "Erika"
            },
            {
                "review_comment_count": "",
                "review_text": "We LOVE these blocks! Total match to all 'other' building blocks, perfect fit. (See photos below.) We have a very happy four year old here creating to his heart content! Great colors, great variety, really great deal for the money. ( Worked out to be cheaper than per pound used ones on EBay.) Also: love the fact the box is totally full, not wastefully bigger than needed. (Though they could skip some of the extra little bags inside, though) And: seems to be a great company. They wrote to make sure all was good and as ordered. We liked that! We highly recommend these blocks and we will be buying more when we need more. Enjoy and happy building! See photos: what's in the box, stuff that was built, how perfectly they fit with Legos.",
                "review_posted_date": "08 Jun 2017",
                "review_header": "Great buy! Very happy!",
                "review_rating": "5.0 ",
                "review_author": "Music Lover"
            },
            {
                "review_comment_count": "",
                "review_text": "We like the Lego brand, but sometimes we need a lot of bricks without paying an exorbitant amount of money. The 1,100 piece kit from Building Bricks was exactly what we were looking for. The Big Questions: 1. Do they really work well with Lego Brand Legos? Yes - they work very well. It's difficult to tell the difference if you're not really trying hard. 2. How much cheaper are they? Is it really worth it? It's hard to compare exact pricing here because this set does not include wheels, doors or special pieces. If I had to choose a product to compare it to, I'd probably compare it with Lego's XXL Classic Box (https://www.amazon.com/10697-Building-Large-Creator-Pieces/dp/B00XJ5C4FW). When pricing per piece, the Lego box is about 5¢ per piece. And yes, you read that right. You're dolling out a nickel for every piece of plastic with Lego's brand stamped on it. :) Building Bricks runs about 3¢ per piece. So the answer is: It's almost half the price - very worth it if you're just needing a lot of standard pieces. As a side note: We really liked the color choices Building Bricks made. They're perfect for expanding your Lego creation palette.",
                "review_posted_date": "20 Mar 2017",
                "review_header": "We like the Lego brand, but this is what we needed...",
                "review_rating": "5.0 ",
                "review_author": "Mb-amazon"
            },
            {
                "review_comment_count": "",
                "review_text": "my grandson is obsessed with Lego building. I found these and it said they were compatible with legos, I was a bit skeptical but the price was so much better than a comparable size set of brand name blocks I decided it was worth a try. They are perfect. I will probably get more for him.",
                "review_posted_date": "12 Nov 2016",
                "review_header": "perfectly compatible",
                "review_rating": "5.0 ",
                "review_author": "ndp"
            },
            {
                "review_comment_count": "",
                "review_text": "As a lifelong Lego fan with a 5 year old daughter who is now getting into building bricks, my biggest complaint with Lego is the price. They are fantastic, but the 1000 piece Educational set runs upward of $60, and the 800+ piece Classic set about $50. I've looked at bulk blocks but consistently found lackluster reviews normally stating \"Doesn't fit with Lego as advertised\" or \"pieces seem of lesser quality\". I stumbled upon Brickyard bricks and saw the tons of high reviews and also the great pricing. 1100 pieces for $30 is a STEAL. They arrived and the pieces are almost indistinguishable from Lego brand bricks. They fit with Lego bricks tight and seem of the same quality of material. The only discernable difference is the Brickyard bricks don't have the Lego name on the top studs of the bricks. Paired with the 10x10 inch baseplates (also very amazing products, even better than Lego brand ones), they are a great deal. Lots of bank for the buck! Highly recommend these sets for anyone looking to expand their building brick collections!",
                "review_posted_date": "12 Oct 2017",
                "review_header": "An absolute STEAL of a product!",
                "review_rating": "5.0 ",
                "review_author": "Joshua M. Ricard"
            }
        ],
        "url": "http://www.amazon.com/dp/B017YHIOFO\n"
    },
    {
        "name": "LEGO Architecture 21030 United States Capitol Building Kit (1032 Piece)",
        "price": "$99.95",
        "ratings": {
            "5 star": "85%",
            "4 star": "8%",
            "3 star": "3%",
            "2 star": "2%",
            "1 star": "2%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Very pleased with this kit. I received it as a (42nd) birthday present and built it over the course of three evenings. It took about four hours total, although I probably could have cut that time in half if my kids weren't \"helping\" so much. I feel the Lego Architecture series has been hit and miss but this set and the White House are both top notch examples. The overall model looks great. I just have so much respect for the designers. The rotunda all by itself is mind-boggling and I love they way the handled the rows of pillars across the entry ways. Most of the exterior walls are built of 1x1 angular bricks, some facing inward to create rows of square windows, others facing outward to suggest arches & round windows. There is an interior space detailing the floor under the rotunda, including a circle of statues, that can be viewed by lifting the rotunda off; a nice little touch. The finished model is very impressive on display, 18\" wide and about 8\" high. One gripe & one suggestion. First my only complaint, the back side of the model does not have nearly the level of detail as the front and sides. This is a real pity because the actual Capital Building has some unique features on the front & rear faces, and I would like to see the designer tackle both. I'm sure this was a cost saving decision made to keep the price & piece-count down, but it's a shame that the model isn't equally detailed from all sides. And a suggestion: Unlike some large Lego projects, the bags in this kit are not numbered. This is a shame, as it's really nice to open one bag at a time and only deal with the pieces needed in the next few steps. So, before starting, get yourself several bowls and a baking tray, open all the bags and sort non-white pieces by color, sort the ocean of blue pieces by size and type. This will definitely pay off in reduced frustration as you work.",
                "review_posted_date": "31 Oct 2016",
                "review_header": "Fun build utilizing some very innovative techniques",
                "review_rating": "5.0 ",
                "review_author": "Jacob A. Ratner"
            },
            {
                "review_comment_count": "",
                "review_text": "this isn't just a gift for younger people. I'm a woman in my 60's and try to stay active. If you like puzzles or need to challenge your mind and work on hand dexterity at the same time this is a great product. This product proved to be just the perfect thing for me. You have to pay attention to detail, hand and finger dexterity is a must, your mind stays active and you can see the building transform before your eyes. It's excellent for anyone who's getting older and wanting something challenging to work on that doesn't require all sorts of other tools or accessories. And the best part is you can take it apart and re-build it another day or use the parts to try and build your own unique design.",
                "review_posted_date": "09 Feb 2017",
                "review_header": "If you like puzzles or need to challenge your mind and work ...",
                "review_rating": "5.0 ",
                "review_author": "SR5K"
            },
            {
                "review_comment_count": "",
                "review_text": "I bought this gift for my boyfriend for Christmas and he loved it. He's a former US Marine and now a police officer so American Pride runs deep in his heart. This lego now sits under a massive star spangled banner that once flew over the US Capitol",
                "review_posted_date": "03 Jan 2017",
                "review_header": "Great Gift for An American Patriot",
                "review_rating": "5.0 ",
                "review_author": "james ouellette"
            },
            {
                "review_comment_count": "",
                "review_text": "I ordered this when it became available from Amazon directly. As a fan of Lego Architecture, and only missing two of their sets from that line, I was very pleased with this build. This set has a larger base than the Imperial Hotel albeit not as intricate. The Capitol is definitely a must have for Lego Architecture enthusiasts and looks amazing.",
                "review_posted_date": "13 Sep 2016",
                "review_header": "I was very pleased with this build",
                "review_rating": "5.0 ",
                "review_author": "Bearuuummmm"
            },
            {
                "review_comment_count": "",
                "review_text": "The Lego Architecture - United States Capitol Building (Lego model # 21030) is an excellent Lego rendition of this iconic architecture. It is one of my favorites and I am proud to own it. It takes some extra patience when building because many of the smaller Lego elements must be stacked & mounted as straight as possible to make it look its best. So I would say that even though it is a fairly easy build, it is also challenging.",
                "review_posted_date": "22 Nov 2016",
                "review_header": "Lego Architecture - United States Capitol Building (Lego model # 21030)",
                "review_rating": "5.0 ",
                "review_author": "another Amazon customer"
            },
            {
                "review_comment_count": "",
                "review_text": "This is a major achievement in Lego models. Certainly the biggest Architecture set yet, this is a massive, beautiful model with tons of detail. It took me a few hours to plan out and assemble (the bags are not numbered, so have fun sorting through 1000+ pieces first) and the experience was hugely therapeutic, enjoyable and mentally stimulating. (My thumbs were a bit raw after, though!) I bought this for $92 and a week later it was on sale for $60 something. It's a steal if you see it on sale, but even at MSRP I think it's a good buy. Lego is an expensive hobby to begin with, and Architecture aims for a more adult price point, and this is the best set in that line. It's a fair price, and comes in just under the 10 cents per piece mark. A word of caution - because almost all the pieces are white, do take care of where you place this model and try to keep it clean. White legos have a tendency to become discolored over time.",
                "review_posted_date": "12 May 2017",
                "review_header": "Stellar, huge model",
                "review_rating": "5.0 ",
                "review_author": "Nick"
            },
            {
                "review_comment_count": "",
                "review_text": "My 7 yr old grandson was THRILLED with this! He actually picked out the Architectural Series because he 'likes a challenge'. Kept him entertained for 3 days straight and he was so proud that building it required using 1,000 pieces.",
                "review_posted_date": "28 Dec 2017",
                "review_header": "Great Lego Series",
                "review_rating": "5.0 ",
                "review_author": "Mark"
            },
            {
                "review_comment_count": "",
                "review_text": "Excellent! LEGO does a superior job with their instruction manual, especially with this 1032 piece set. The finished model is a great display scale. It's a good challenge and one I hated to finish......, time to rip it part and rebuild. A few hours a day to prolong the fun and completed in 4 days. All parts were accounted for and there were even a few smaller pieces left over. The overall representation is very good. I'm hoping Lego will develop some classic baseball stadiums, Wrigley Field, Fenway Park, Camden Yard and the original Tiger Stadium in the smaller scale \"mini\" bricks like the skyline series. smaller scale similar to the skyline series. this one is a must have for your collection. similar scale of the skyline series. I like the \"mini\" brick scale the best.",
                "review_posted_date": "22 Jul 2017",
                "review_header": "A don't miss offering!",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            }
        ],
        "url": "http://www.amazon.com/dp/B01CVGV5H2\n"
    },
    {
        "name": "LEGO Friends Heartlake Summer Pool 41313",
        "price": "$36.00",
        "ratings": {
            "5 star": "92%",
            "4 star": "6%",
            "3 star": "1%",
            "1 star": "1%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Listening (pre-purchase) to my almost 9 year old granddaughter explain all the features this set would have, it seemed to have included more than other much higher priced sets had. Then, when my granddaughter showed me the set after she built it, she had discovered even more that it had that she hadn't noticed online. We were choosing between this & a much more expensive set that wouldn't have produced the excited phrase I got to hear many times: \"And it has ____! And it has _____!\" In the blanks were items like \"another slide here! and a shower, and a hot tub, and it even has..!\" I don't remember the feature that was a surprise to her. I like all Lego sets, but this one was better designed, cramming in more features than expected.",
                "review_posted_date": "09 Feb 2018",
                "review_header": "More features than other sets",
                "review_rating": "5.0 ",
                "review_author": "HalfFullJulie"
            },
            {
                "review_comment_count": "",
                "review_text": "My 8 and 10 year old girls love LEGOs. For her most recent birthday, my daughter searched through dozens of different LEGO sets before finally deciding that the Summer Pool was the best one to add to her collection. The girls were so excited to immediately put it together when it arrived. The instructions are simple but the attention to every little detail is what I especially adore about these sets. They're just so fun. The girls can spend hours playing with them. I hope they never outgrow their love for them.",
                "review_posted_date": "18 Aug 2017",
                "review_header": "Fun Details",
                "review_rating": "5.0 ",
                "review_author": "Utah Mom"
            },
            {
                "review_comment_count": "",
                "review_text": "My 8 year old loves this pool set more than the last lego friends pool from a few years ago. The cabana, heart spa and swim up juice bar are her favorite parts. Lego friends delivers as usual",
                "review_posted_date": "23 Feb 2017",
                "review_header": "heart spa and swim up juice bar are her favorite parts. Lego friends delivers as usual",
                "review_rating": "5.0 ",
                "review_author": "Malia O."
            },
            {
                "review_comment_count": "",
                "review_text": "I purchased this for my 6 year old niece, who had a few of the smaller Heartlake sets. She immediately sat down and put it all together with very little guidance from adults and loves it. The directions were very clear and easy to follow, and the set had a lot more to it than I expected, including pool, showers, slide, a bathroom, a snack cabana, a lifeguard stand, and a hot tub next to a seating area - and of course, two girl figures with pool toys. There are LOTS of tiny pieces, so beware and be ready to search for them. Small children may need help with application of stickers as well. Very happy with this purchase!",
                "review_posted_date": "24 Feb 2018",
                "review_header": "Great value for the price!",
                "review_rating": "5.0 ",
                "review_author": "Rebecca Smucker"
            },
            {
                "review_comment_count": "",
                "review_text": "My grand kids love them. They are Lego nuts. The extra pieces are what I like best because they seem to misplace the smaller pieces even though they have a special drawer for each type of block. When Lego first came out years ago they weren't very creative so I only bought a couple of sets for my children, but now that my grandkids are getting them they are fantastic!!! My granddaughter loves the fact that you have Legos for girls, her friends collection is growing with every house and she can put together the older kids legos just fine",
                "review_posted_date": "16 Nov 2018",
                "review_header": "The tracks on the big equipment needs to be easier to put on",
                "review_rating": "5.0 ",
                "review_author": "Jan"
            },
            {
                "review_comment_count": "",
                "review_text": "Excellent!!! This was for my granddaughter and she absolutely love it. It was a fun experienced to built the Lego pool. She enjoy every minute of it. will recommend to family and friends. Thanks!",
                "review_posted_date": "22 Jan 2018",
                "review_header": "Great product!",
                "review_rating": "5.0 ",
                "review_author": "Dama"
            },
            {
                "review_comment_count": "",
                "review_text": "My granddaughter LOVES this Lego set! It is her favorite. After putting it together she sat and plays with it for quite awhile. She continues to do this on a regular basis now. By far......her favorite Lego set!",
                "review_posted_date": "02 May 2017",
                "review_header": "It is her favorite. After putting it together she sat and plays ...",
                "review_rating": "5.0 ",
                "review_author": "River Guy"
            },
            {
                "review_comment_count": "",
                "review_text": "My granddaughter loved it. It seemed to be a very cute project with different parts to assemble.",
                "review_posted_date": "13 Sep 2017",
                "review_header": "My granddaughter loved it. It seemed to be a very cute ...",
                "review_rating": "5.0 ",
                "review_author": "San Diego Shopper"
            }
        ],
        "url": "http://www.amazon.com/dp/B01KILRPO4\n"
    },
    {
        "name": "LEGO Friends Stephanie's House 41314 Toy for 6-12-Year-Olds",
        "price": "$47.99",
        "ratings": {
            "5 star": "89%",
            "4 star": "5%",
            "3 star": "2%",
            "2 star": "1%",
            "1 star": "3%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "my 8 year old loved it!! She put it together by herself, the instructions are clear and easy.",
                "review_posted_date": "28 Mar 2017",
                "review_header": "Four Stars",
                "review_rating": "4.0 ",
                "review_author": "KatieBee"
            },
            {
                "review_comment_count": "",
                "review_text": "super, super detailed. awesome and very colorful comes with many items including, computer, toilet rabbit + hutch, real working swing, pie, cupcakes, cupcake mix + tools, many many utensils, oven, shower, detailed castle bed,tv, movable stairs, vacuum. if there was a five million stars opitoin i would totally choose it.",
                "review_posted_date": "10 Jan 2018",
                "review_header": "even better than expected! :)",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "This set was a lot of fun to put together with my daughter. The finished product looks terrific. Plenty of fun features are found in the house. My daughter thinks it's really cool. She really likes the \"stained glass\" accents on the glass in the bay window. My daughter is quite concerned that a bedroom does not exist for Staphanie's parents. But she still loves the set. The figures and pet are cool additions to the Lego Friends set.",
                "review_posted_date": "17 Feb 2018",
                "review_header": "Fun Lego Friends Set.",
                "review_rating": "5.0 ",
                "review_author": "F. Olalde"
            },
            {
                "review_comment_count": "",
                "review_text": "I purchased this Lego house as a gift for my 8 year old daughter. She was able to put it together herself in two days. It's a nice size house with lots of accessories and detail. When my daughter isn't playing with it she keeps it on display in room. She has other sets she plays with along with this one so it makes playing more interesting.",
                "review_posted_date": "06 Nov 2017",
                "review_header": "Lego Friends Stephanie's House is great for play itself or with other Lego sets",
                "review_rating": "5.0 ",
                "review_author": "Poet Lover 101"
            },
            {
                "review_comment_count": "",
                "review_text": "My 4-year old loved it. We bought it for her as a christmas gift after she kept asking for it, after seeing YouTube reviews. She loved building the house together with us. But once we finished she took it apart and would build her own version of the house. No complaints. They're Legos and are really great for children to explore their imaginations. My daughter tend to use the larger pieces to build, not so much on the tiny pieces. There is A LOT of tiny pieces. They're so small that they can easily be mistaken as cookie crumbs and be vacuumed up. They are a pain in the butt because of how tiny they are. Trying to vacuum I literally have to go on my knees to make sure there aren't any pieces on the floor. We put all the pieces in a gallon sized ziploc bag and she would keep all the unused pieces in the bag. But accidents do happen and they sometimes do fall off the table. So just a heads up. These will be a mom's cleaning nightmare.",
                "review_posted_date": "28 Jan 2018",
                "review_header": "Great but a lot of tiny pieces",
                "review_rating": "5.0 ",
                "review_author": "buzzybee"
            },
            {
                "review_comment_count": "",
                "review_text": "We love all the lego sets. The product itself was packaged VERY well. The instructions are easy to read, my 10 year old put this together herself (she would NOT let me help, pftt - whatever). She worked on it every night for about 3-4 evenings.",
                "review_posted_date": "21 Jun 2017",
                "review_header": "We love our legos!",
                "review_rating": "5.0 ",
                "review_author": "T Coffin"
            },
            {
                "review_comment_count": "",
                "review_text": "I had Lots of fun constructing this with my 9 year old Daughter . Instructions are easy to use, and I will be buying more of this item",
                "review_posted_date": "06 Nov 2017",
                "review_header": "I had Lots of fun constructing this with my 9 year old Daughter",
                "review_rating": "5.0 ",
                "review_author": "Mrunderdog"
            },
            {
                "review_comment_count": "",
                "review_text": "I got this set for our 11-year-old granddaughter's birthday and she loves it. She built it right away.",
                "review_posted_date": "31 May 2017",
                "review_header": "Great set",
                "review_rating": "5.0 ",
                "review_author": "Bonnie Dickson"
            }
        ],
        "url": "http://www.amazon.com/dp/B01KIOREFG\n"
    },
    {
        "name": "LEGO Creator Robo Explorer 31062 Robot Toy",
        "price": "$15.39",
        "ratings": {
            "5 star": "87%",
            "4 star": "9%",
            "3 star": "2%",
            "2 star": "0%",
            "1 star": "2%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I’m really a big fan of the LEGO Creator sets. If your kiddo is bored with traditional LEGO sets this is your solution. This is by far one of the coolest LEGO projects my son has done. I wouldn’t say this is necessarily more advanced, just a different challenge. My son is 5 and knocked this out in an hr without any assistance so if you have a little one, have no fear.",
                "review_posted_date": "21 Aug 2018",
                "review_header": "Favorite LEGO set yet!",
                "review_rating": "5.0 ",
                "review_author": "Jordan Sherwood"
            },
            {
                "review_comment_count": "",
                "review_text": "I saw this kit and I HAD TO HAVE IT. I'm an adult fan of LEGO (I find building kits extremely relaxing), but I also have a mild obsession with funky robots. Both of those worlds coming together in one kit for under $20?! Shut up and take my money! This little guy looks like he could be the son of Johnny 5 from \"Short Circuit\". There's some great pieces here and the light brick is an awesome touch, but I doubt I'll be taking him apart, because he just looks too good in my office with all of my other robot toys.",
                "review_posted_date": "29 Apr 2017",
                "review_header": "Looks like the Son of Johnny 5",
                "review_rating": "5.0 ",
                "review_author": "K.L.C"
            },
            {
                "review_comment_count": "",
                "review_text": "This set has it all. It's fun to build, it's got a bunch of useful parts, it's fun to play with and VERY pose-able, and it's super adorable! The alternate builds are both pretty fun, but the main robot build is where it's at. You can pick up the rocks, pose it balancing on one hand, adjust the eyes to get a bunch of expressions, and roll it all around! The tracked wheels are actually linked to a regular rubber wheel, meaning that the treads will spin if you move it over smooth OR rough surfaces! The light brick is integrated in unique ways for each of the three models, too, which can give some inspiration on all the different ways you can use one! The only real problem I have with the aesthetic and playability is the arm of the robot that has the light brick. That arm looks kind of stubby compared to the other one in some poses, and it doesn't articulate at the elbow at all. Not a huge problem though! As for parts, the main draw is obviously the light brick. This is a relatively inexpensive way to get one. The large number of pieces in this particular shade of blue is a huge bonus to me personally since it's one of my favorite part colors that LEGO makes, but it really isn't a super common color in general anyway. It's also a pretty good set to get if you want more of the tracks/treads. The Creator line of sets pretty much always come with a good variety of uncommon and common pieces for a relatively low price, and this one is no different in that respect. I bought this set for the parts, but honestly I don't want to take it apart! It's just so much fun to play with and pose, plus it looks adorable on display. But if you do just want the parts, it's got a lot to love!",
                "review_posted_date": "11 Feb 2018",
                "review_header": "An excellent set for a very reasonable price!",
                "review_rating": "5.0 ",
                "review_author": "Forest"
            },
            {
                "review_comment_count": "",
                "review_text": "Grandson is eight and he put this lego together really fast. He loves it.",
                "review_posted_date": "29 Apr 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "Joan M"
            },
            {
                "review_comment_count": "",
                "review_text": "My son really wanted the Lego Boost robot with programming, but I was not so keen to dish out the $160 to get it for him. We ended up getting this one as a consolation gift, and he loved it! Of course, it's not programmable, but the parts still move manually. It's the coolest Lego set we've owned so far (and we have quite a few!)!!",
                "review_posted_date": "10 Feb 2018",
                "review_header": "Coolest Lego set!",
                "review_rating": "5.0 ",
                "review_author": "Shanna Fowler"
            },
            {
                "review_comment_count": "",
                "review_text": "Really cute lego robot for ages 6-12 with moving treads, It really does have a light that you can turn on and off so children love to play with it. Not the most impressive robot, but it does work and goes together quickly for target age group. My grandson takes his lego figures apart after building them so this is an inexpensive little robot that kept him entertained for months. With experence of putting lego figures together, six year old children can put this one together and have a lot of fun. The treads are cheaply built and will come off if you treat the robot roughly but they do work.",
                "review_posted_date": "09 Sep 2017",
                "review_header": "Great Lego Robot",
                "review_rating": "4.0 ",
                "review_author": "Im Dallas"
            },
            {
                "review_comment_count": "",
                "review_text": "Bigger than I expected but my 7 year old can do it. Very happy with the price too",
                "review_posted_date": "18 Oct 2017",
                "review_header": "Very happy with the price",
                "review_rating": "4.0 ",
                "review_author": "BigMontana"
            },
            {
                "review_comment_count": "",
                "review_text": "My son and I have built all 3 sets. We love the 3 in 1 sets best because we really feel motivated to take them apart and remake them - we just don't do this with the other sets. My son is almost 4 and said this is his favorite one yet (we have mythical creatures and dinosaurs which are both really cool) - I'm thinking the light and the fact that it is a robot with lots of moving parts helps. He's been playing with the built robot models as toys - they hold up well. While I'm always fascinated by the ways Lego has utilized the same pieces in different ways - my son actually noticed the creativity in using the light as eyes, a laser, and a jet boost - it got him thinking - which is priceless right? The instructions are easy enough he's able to follow them with a bit of help (at his age he had a much easier time with the dinosaur kit though.) As we both love to build - this has provided a great opportunity for us to work together, practice teamwork, and have lots of little teaching moments. :-) My only complaint (if you could call it that) is that the other sets have a \"secret\" 4th model if you go online - so far this just has the 3.",
                "review_posted_date": "17 Sep 2018",
                "review_header": "Fun over and over and over and over",
                "review_rating": "5.0 ",
                "review_author": "Avid Purchaser"
            }
        ],
        "url": "http://www.amazon.com/dp/B01KJEO7TQ\n"
    },
    {
        "name": "LEGO Creator Mighty Dinosaurs 31058 Dinosaur Toy",
        "price": "$11.99",
        "ratings": {
            "5 star": "87%",
            "4 star": "7%",
            "3 star": "2%",
            "2 star": "2%",
            "1 star": "2%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "This is one of the most fun 3-in-1 kits that I have found at such a great price. You have the ability to build not only the advertised 3 dinosaurs but also a fourth bonus build set of instructions are available at Lego (see photos attached to this review.) The builds that come with the kit are a T-Rex, a Triceratops and a Pterodactyl. The bonus build appears to be a Brachiosaurus. We bought two kits so we could have dinosaur battles with our grandson. He is really getting into dinosaurs at the moment, so this kit came at a perfect time. In order to construct each dinosaur, you pretty much have to take the previous one completely apart. It only takes a short time (less than an hour) to rebuild it though it may take younger kids more time. The dinosaurs are articulated very well. The legs, tails, and neck/heads all have hinge points. It makes it great fun to use in battle. We love the kit. The only thing that could make it better would be in Lego had offered it in a variety of colors.",
                "review_posted_date": "31 Mar 2017",
                "review_header": "Cool 3-in-1 Lego Dinosaur Kit with bonus build available",
                "review_rating": "5.0 ",
                "review_author": "iiiireader"
            },
            {
                "review_comment_count": "",
                "review_text": "One of the best LEGO sets of its size. Sturdy enough to actually play with without it falling to pieces (and that's saying a lot when it's a T-Rex). Sure, a claw or foot might pop off, but nothing catastrophic. I am buying another set to keep for the next time one of my daughter's friends has a birthday party. Any kid who likes dinosaurs and LEGOs (which is all of them, right?) should love this set.",
                "review_posted_date": "02 Sep 2017",
                "review_header": "Great set. My daughter loves it (6 years old).",
                "review_rating": "5.0 ",
                "review_author": "CJ Kelton"
            },
            {
                "review_comment_count": "",
                "review_text": "My son loved this set. Admittedly, because he is 4 years old, we only got about a quarter of the way through the construction before having to take a break. He then decided he would prefer to turn what we had constructed into a spaceship instead of the dinosaur, and took creative reign at that point, but I think in a year or so, he will have the patience to actually complete this as designed. In spite of not using it as designed, the kit is really cool, and he absolutely loves the claws and bones, etc and uses them with his other lego sets.",
                "review_posted_date": "28 Jan 2018",
                "review_header": "4 Year Old Boy LOVES the bones & claws!",
                "review_rating": "5.0 ",
                "review_author": "Andrea"
            },
            {
                "review_comment_count": "",
                "review_text": "This didn't take long to put together, but my son loved it, despite being solely interested in Ninjago Legos usually. I believe his exact words were, \"It's cool, mom.\" For the price, I'd say that's a win. I wish the rest of the Mighty Dinosaurs collection was as reasonably priced.",
                "review_posted_date": "08 Jun 2017",
                "review_header": "Great for the price!",
                "review_rating": "5.0 ",
                "review_author": "Bridgett"
            },
            {
                "review_comment_count": "",
                "review_text": "this is actually a 4n1. you can find the 4th set of directions on lego.com/creator. My son loves this. Good selection of builds. Sometimes when you buy creators there are cool build and others that aren't as cool. My son loves all 4 of these! He wants more of these sets so he can have a dino collection so he doesn't have to take a part.",
                "review_posted_date": "15 Feb 2017",
                "review_header": "good set of builds with a 4th one too!",
                "review_rating": "5.0 ",
                "review_author": "Lcharapich"
            },
            {
                "review_comment_count": "",
                "review_text": "My sons have many, many lego sets. This is definitely one of my favorites. The details are amazing (especially the teeth and claws). We have only assembled it as the t-Rex so far, but it is so cool. This is a no brainer for any 4-6 year old (girl or boy) birthday gift.",
                "review_posted_date": "27 Dec 2017",
                "review_header": "One of my favorite lego sets so far. And so well priced!",
                "review_rating": "5.0 ",
                "review_author": "Arakashi"
            },
            {
                "review_comment_count": "",
                "review_text": "This is a fantastic Lego set. My son had me buy it for him with some of his birthday money, and he's had to share it with my 3yo. The three different dinosaurs in one set thing is seriously awesome, and I really don't mind being asked to transform the thing into a new dinosaur. (I like putting Lego together even at 38, heh) Each dinosaur has a lot of moving parts, which gets a bit frustrating since it comes apart easily, but that's also what makes it really cool. My younger son's face lights up whenever he sees the \"new\" dinosaur. Very clever design, and I'll definitely buy others like it.",
                "review_posted_date": "31 Jan 2018",
                "review_header": "Great dinosaur set",
                "review_rating": "5.0 ",
                "review_author": "Crystal Watanabe"
            },
            {
                "review_comment_count": "",
                "review_text": "The people at Lego are amazing, this kit is the most creative of any I've ever seen or dreamed of. The ball joints give the creations a very lifelike range of motion, my 5 yo son loves these.",
                "review_posted_date": "09 May 2017",
                "review_header": "So creative",
                "review_rating": "5.0 ",
                "review_author": "RG"
            }
        ],
        "url": "http://www.amazon.com/dp/B01KJEOCDW\n"
    },
    {
        "name": "LEGO City Police Station 60141 Building Kit with Cop Car, Jail Cell, and Helicopter, Top Toy and Play Set for Boys and Girls (894 Pieces)",
        "price": "$99.95",
        "ratings": {
            "5 star": "90%",
            "4 star": "7%",
            "3 star": "1%",
            "2 star": "1%",
            "1 star": "1%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Bought this for my 5 year old brother who loves legos. Age appropriate and fun to build :)",
                "review_posted_date": "05 Aug 2017",
                "review_header": "Great city",
                "review_rating": "5.0 ",
                "review_author": "Brock & Jess"
            },
            {
                "review_comment_count": "",
                "review_text": "Great details, lots of fun. My boys love playing with this set. So many great things to this set. Wouldn't recommend for younger kids, the amount of steps and details are pretty extensive. However if you're like me and you like building the sets for your youngins, then this one is still a lot of fun for younger kids to play with once it's assembled.",
                "review_posted_date": "25 Feb 2018",
                "review_header": "And amazing set, hours of fun!",
                "review_rating": "5.0 ",
                "review_author": "Kara P."
            },
            {
                "review_comment_count": "",
                "review_text": "This product arrived today and the grandkids were thrilled! Thank you for the prompt delivery.",
                "review_posted_date": "21 Apr 2017",
                "review_header": "Lego Products from Amazon",
                "review_rating": "5.0 ",
                "review_author": "Sandra Waldron"
            },
            {
                "review_comment_count": "",
                "review_text": "My 5-year-old is obsessed with legos and police. This was a dream-come-true gift for him. It took a long time to build (seeing as how he is 5) but it has been worth it. He has spent hours playing with this and incorporating the other police legos he has. Well worth the investment for our family!",
                "review_posted_date": "13 Sep 2018",
                "review_header": "A police-loving kid’s dream!",
                "review_rating": "5.0 ",
                "review_author": "Alicia"
            },
            {
                "review_comment_count": "",
                "review_text": "Bought this for my 13 year old son who put it together himself within hours. He displays it on his dresser and it looks pretty cool. Received product in perfect condition and got it quickly.",
                "review_posted_date": "26 Feb 2018",
                "review_header": "Lego City Police Station",
                "review_rating": "5.0 ",
                "review_author": "Poet Lover 101"
            },
            {
                "review_comment_count": "",
                "review_text": "This was a birthday present for our 5 year old great grandson. His mom says he loves, loves, loves it! You can't go wrong with Legos!",
                "review_posted_date": "31 Mar 2017",
                "review_header": "LEGO City Police Station 60141",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "It is a super set for toddlers who are fond of police! It contains both: police department and prison. As always, everything is very realistic, super quality , good assembling instructions. Lego is amazing constructor for imagination development!",
                "review_posted_date": "12 Sep 2017",
                "review_header": "It is a super set for toddlers who are fond of police",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "7 y.o and 5 y.o put it together by themselves in two days. Still playing after 2 month. All pieces and parts were there. It is overpriced to my opinion. However it looks nice and bright colors.",
                "review_posted_date": "23 Feb 2018",
                "review_header": "nice design",
                "review_rating": "5.0 ",
                "review_author": "Alla"
            }
        ],
        "url": "http://www.amazon.com/dp/B01KKTNA6Q\n"
    },
    {
        "name": "LEGO City ATV Race Team 60148 Best Toy",
        "price": "$15.99",
        "ratings": {
            "5 star": "89%",
            "4 star": "8%",
            "3 star": "2%",
            "2 star": "1%",
            "1 star": "0%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "We have become Lego freaks as of late, the grandkids are really getting into building and creating their own projects, This set was so much fun to put together as a family, I have the kids find each piece as it's needed, and use the instruction book to help put it in the correct place. Even at ages 5 & 7 they are able to follow the directions, which are detailed, easy to follow, pictures. We started by building the ATV's first and of course the minifigs, (we lost the 5 yr old here, because the ATVs were just too much fun ). Then we built the truck and trailer. Once assembled it is a very sturdy piece, the kids drive the truck and trailer all around as well as the ATVs, and we have t lost any pieces.we have a lot of new sets and this is by far their favorite. I think we may need to purchase a second set !! Highly recommend.. fun for the whole family",
                "review_posted_date": "07 May 2017",
                "review_header": "A great addition to any Lego collection, great for hours of fun!!",
                "review_rating": "5.0 ",
                "review_author": "nascar lover"
            },
            {
                "review_comment_count": "",
                "review_text": "This Lego set was a gift for my 6 year old grandson. Of the gifts we gave him for Christmas, this was the one he wanted to play with first. He and I, along with his 4 year old sister, enjoyed putting it together. All of the pieces were there and the instructions were spot on. The set does have some really small parts, but if the pieces are grouped by type it was easy for him to put together and he barely looked at the directions. Great price through Amazon. Definitely recommend for lasting play-ability as the vehicles are really sturdy once put together.",
                "review_posted_date": "28 Jan 2018",
                "review_header": "Perfect Lego Kit for Kids Age 4-7",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "You just can't go wrong with Legos. I'm an adult, don't have kids, but I still like building these sets. It's fun and a good distraction. I don't think you're ever too old to build with Legos. This one was fun because you get a couple of minifigs and a couple of ATVs, so you can have them race.",
                "review_posted_date": "05 Oct 2017",
                "review_header": "Can't go wrong",
                "review_rating": "5.0 ",
                "review_author": "Cat"
            },
            {
                "review_comment_count": "",
                "review_text": "Great kit! Pickup truck ended up bigger than I thought it would be. My son loves it even though he was too young to build it by himself. Really impressed with the solid design and the fun factor once assembled, especially with the functionality of the moveable ramps on the truck and trailer.",
                "review_posted_date": "10 Sep 2017",
                "review_header": "My son loves it even though he was too young to build it by himself.",
                "review_rating": "5.0 ",
                "review_author": "HelloJim"
            },
            {
                "review_comment_count": "",
                "review_text": "This is a great play set. It does hold together with moderate play from 5 and 7 year old boys. Seven year old had no trouble assembling this set. We purchased this at a great price from Amazon.",
                "review_posted_date": "26 Mar 2017",
                "review_header": "Super Fun Set",
                "review_rating": "5.0 ",
                "review_author": "Virgil"
            },
            {
                "review_comment_count": "",
                "review_text": "My son loves this LEGO set. The little four-wheelers are surprisingly durable, as my son likes to play with the sets that he's made. He's six and could do this on his own. I'd recommend it.",
                "review_posted_date": "27 Apr 2017",
                "review_header": "Great set.",
                "review_rating": "5.0 ",
                "review_author": "Amanda N."
            },
            {
                "review_comment_count": "",
                "review_text": "I got this for my 4 year old for his birthday and he LOVES it!!! It's such a fun set with the 4 wheelers! He plays with them all day and pulls them apart and makes other \"trailers\".",
                "review_posted_date": "13 Sep 2017",
                "review_header": "Fun Boy Set",
                "review_rating": "5.0 ",
                "review_author": "icecreamlover48"
            },
            {
                "review_comment_count": "",
                "review_text": "First of all, it's a lego set so it's gonna be great. But just a nitpicky detail (because the pictures dont capture it): you can see the rear wheels through the bed of the truck, so it's not 100% realistic.",
                "review_posted_date": "08 Jul 2017",
                "review_header": "wheels galore",
                "review_rating": "5.0 ",
                "review_author": "P"
            }
        ],
        "url": "http://www.amazon.com/dp/B01KKTNB7O\n"
    },
    {
        "name": "LEGO City Great Vehicles Pizza Van 60150 Construction Toy",
        "price": "$12.99",
        "ratings": {
            "5 star": "86%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "1%",
            "1 star": "1%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "All minifigs love a good pizza! This was a fun little build for a fun centerpiece to a minifig scene. Now some of my Star Wars troopers can stop and share a slice between battles. For $20 this is a good way to spend an hour or so. The build itself is very logical and sturdy. It's quite difficult to manipulate minifigs in either the cabin or the kitchen/service area, but food trucks are very cramped in real life too so in this case it makes sense. The 2 minifigures included are pretty basic - a pizza chef and a woman who is either a customer or a delivery driver (via the scooter, which I did not build). Her hair piece is so big that she can't turn her head or sit in the driver's seat. I have absolutely no clue why this set's instructions are spread across two booklets; kind of wasteful and just another thing to deal with on the table, but not an actual problem with the set.",
                "review_posted_date": "01 Feb 2017",
                "review_header": "Very cute",
                "review_rating": "4.0 ",
                "review_author": "Nick"
            },
            {
                "review_comment_count": "",
                "review_text": "This was a great build! It comes with a pizza and little slices of pizza! The awnings on either side open up to serve the customers. The detail is adorable. My partner and I are 30 and 27, respectively, and although this build is recommended for 5-12 year olds, we had a blast. The LEGO City builds are very awesome and come with many unique parts. Can't recommend enough.",
                "review_posted_date": "04 May 2017",
                "review_header": "This was a great build! It comes with a pizza and little ...",
                "review_rating": "5.0 ",
                "review_author": "Callie"
            },
            {
                "review_comment_count": "",
                "review_text": "This was a fun, inexpensive set to build. Sometimes you just don't WANT to work on a 2,500 piece set, and just need something cute for a little distraction. This was perfect. Cute concept, and my son loved the theme. No missing parts, all went together well and was durable.",
                "review_posted_date": "03 Jun 2017",
                "review_header": "Fun kit for the price",
                "review_rating": "5.0 ",
                "review_author": "JDThird"
            },
            {
                "review_comment_count": "",
                "review_text": "So adorable. My 4 1/2 yr old grandson and I did this together and while it took us a couple of hours to complete, it is beautiful and STURDY. ( for a LEGO). The figures are very relatable and this is one of our favorite lego vehicles. The side doors lift all the way up/open to reveal a pizza oven and it's like a real food truck. You will not be disappointed, but be prepared for LOTS of Layers of building.",
                "review_posted_date": "19 Jun 2017",
                "review_header": "So adorable. My 4 1/2 yr old grandson and I ...",
                "review_rating": "5.0 ",
                "review_author": "shopper"
            },
            {
                "review_comment_count": "",
                "review_text": "LEGO never disappoints! This pizza truck is very cute and a great addition to my kids' Lego city.",
                "review_posted_date": "09 Feb 2017",
                "review_header": "This pizza truck is very cute and a great addition to my kids' Lego city",
                "review_rating": "5.0 ",
                "review_author": "MaggieB"
            },
            {
                "review_comment_count": "",
                "review_text": "Extra easy assembly, 7 year old was eyeing this for a couple of weeks. Happy boy now that he has two of these.",
                "review_posted_date": "17 Mar 2017",
                "review_header": "Extra easy assembly, 7 year old was eyeing this for ...",
                "review_rating": "5.0 ",
                "review_author": "Virgil"
            },
            {
                "review_comment_count": "",
                "review_text": "This is another great build by LEGO! Our four year old was occupied with building it for over an hour! There is a local pizza truck we frequent weekly sounds he was extra excited to build it! I loved the little details for the inside of the prep area of the truck!",
                "review_posted_date": "05 Jan 2018",
                "review_header": "Love this pizza truck!",
                "review_rating": "5.0 ",
                "review_author": "LnAsMom"
            },
            {
                "review_comment_count": "",
                "review_text": "My 4 1/2 year old grandson is in love with these sets....he sits and builds step by step by following the directions. They really look great when he's finished, and gives him a great sense of accomplishment. I've tried encouraging him to build our bulk sets any way he wants, but for now, he's mesmerized. Thanks, Lego!!!",
                "review_posted_date": "11 Sep 2018",
                "review_header": "Really cool",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            }
        ],
        "url": "http://www.amazon.com/dp/B01KKTNBNI\n"
    },
    {
        "name": "LEGO Classic Creative Building Box Set 10704",
        "price": "$35.42",
        "ratings": {
            "5 star": "90%",
            "4 star": "6%",
            "3 star": "3%",
            "2 star": "1%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "This is a good set for starting Lego or adding to Lego collection. Has many different useful parts in a variety of colors. Not enough parts in 1 color to build much in same color but plenty if you mix & match colors - for example if building a roof you need to use multiple color roof parts. The box it comes in is quite big for part count (15'' tall). Over all I like this set.",
                "review_posted_date": "03 Jun 2017",
                "review_header": "Good starter set or addition to Lego collection.",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "So much better than sets that are more like boring models. My kids actually have to imagine there way through building new and inventive things.",
                "review_posted_date": "09 Jul 2017",
                "review_header": "So much better than sets that are more like boring models",
                "review_rating": "5.0 ",
                "review_author": "Jason Gabler"
            },
            {
                "review_comment_count": "",
                "review_text": "This creative box has a whole rainbow of different colors and enough variety of pieces to keep kids and adults entertained for days. The price is also amazing--around 3 cents per piece-- considering the usual cost per piece for Legos. With a decent carrying handle on top, the box can also double as a storage container once you take the pieces out of the plastic bags. Pieces come in plastic bags, sorted by color. There is also an \"ideas\" booklet which gives instructions on how to build a few different simple creations.",
                "review_posted_date": "19 Dec 2017",
                "review_header": "Great mix of colors and bricks for hours of fun",
                "review_rating": "5.0 ",
                "review_author": "Jonathan Cohen"
            },
            {
                "review_comment_count": "",
                "review_text": "I was so excited to buy this set for my three old and was not disappointed. It comes with multiple colors and tons of the tiny parts that include wheels, eyes, etc.. it also has an idea book that's been really helpful. you'll really have to watch your kids with this set if they are still little. Mostly because it's so easy to lose pieces. But I never had Legos growing up and was truly so excited about getting my little guy this set. We've already had loads of fun!",
                "review_posted_date": "29 Dec 2017",
                "review_header": "First Lego set!",
                "review_rating": "5.0 ",
                "review_author": "Danielle Williams"
            },
            {
                "review_comment_count": "",
                "review_text": "Not really impressed. Most of blocks are part of certain set (dragon, ship etc) so aside from making specific items, there' a little room for creativity. It was my fault fornot researching this further - I was hoping for a more \"default\" version that doesn't limit your imagination as much as this one.",
                "review_posted_date": "29 Jun 2018",
                "review_header": "Not really impressed. Most of blocks are part of ...",
                "review_rating": "3.0 ",
                "review_author": "SerbianWolf"
            },
            {
                "review_comment_count": "",
                "review_text": "Great starter set. The only negative would be the amount of tiny parts included. If you have small children, prepare to set these aside or be there to help little fingers that will get frustrated. There was also a weird variation of color hues. I remember primary colors growing up, now there are pieces for.... shading I guess.",
                "review_posted_date": "18 Jul 2018",
                "review_header": "Great starter set",
                "review_rating": "4.0 ",
                "review_author": "Chris"
            },
            {
                "review_comment_count": "",
                "review_text": "Everything you hoped for and more! It has directions for some of the builds, but half of them you have to go online for.",
                "review_posted_date": "23 Jul 2018",
                "review_header": "It's Lego, it's great!",
                "review_rating": "5.0 ",
                "review_author": "M. Krug"
            },
            {
                "review_comment_count": "",
                "review_text": "Excellent mix of bricks for free building!",
                "review_posted_date": "05 Oct 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "Mr.N0e"
            }
        ],
        "url": "http://www.amazon.com/dp/B06XDSN1MB\n"
    },
    {
        "name": "LEGO Boost Creative Toolbox 17101 Building and Coding Kit (847 Pieces)",
        "price": "$159.95",
        "ratings": {
            "5 star": "68%",
            "4 star": "14%",
            "3 star": "4%",
            "2 star": "5%",
            "1 star": "9%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "OVERALL CONCLUSION ================== LEGO boost is 80% of the learning at 50% of the cost and 20% of the hassle of LEGO’s fancier Mindstorms product. LEGO Boost compares really well to all other competing robots out there, so if you want your kid to know about coding, robotics, mechanics or technology, it’s a really easy choice. The age range is spot-on: 7 to 12 years old seems just right. TOP PROS: 1) Great value for what you get; 2) Extensive models for a lot of fun; 3) Painless setup so that kids can use the app and Bluetooth connection easily. TOP CONS: 1) Needs an iPad or Android tablet, which can triple the cost; 2) Limited accessories and other sensors/motors so far; 3) App can be very confusing at times and the “unlocking” of levels is irritating WHAT CAN LEGO BOOST DO? ====================== You can build 5 different, intricate projects right out of the box. LEGO included a huge assortment of great parts so that you can build a standing robot, a guitar, a “factory”, a cat, and a horizontal rover bot. Each model is part toy and part experiment because the app has included code that makes the characters lively and interactive while leaving room for customization. All the sounds and processing is done by your tablet, so that’s a smart way to save costs and make the “brain” brick really simple (which LEGO calls the “Move Hub”). The LEGO Boost app guides you through building and programming each robot in a set of challenges that are unlocked as you go. My 7-year-old and I could only figure out how to do Vernie the tall robot so far, which was sad because he wanted to start with the guitar or factory. This is minor bump in the road, though, because I envision this being a popular toy for a very long time. The fact that the Bluetooth setup was so painless (no pairing on iOS, it was like magic) makes this much easier to deal with than other robots like Cozmo. NOTE: If your app crashes, power off your iPad completely. This worked great for me. I’ve noticed that upon installation, some apps need a power cycle to work their best. I don’t know if this is a memory leak in the iPad or what. I’m running the app on a 3-year-old iPad Air 1 (not 2) and it works great. Anything newer should be fine, and LEGO has a device check section on their website. IS LEGO BOOST FUN AND EDUCATIONAL? ================================ For sure, this product is a ton of fun and teaches a lot about coding/logic, problem-solving, and creativity. My younger two kids, ages 4 and 7, are over-the-moon-excited about it and have been counting down the days until it arrived on August 1st. My 7-year-old already spent three hours building the first robot and he was completely enthralled. I was especially impressed by the robot’s head motion and the intricacy of the gears used in this model. The app has been fun to go through, but we’re only partially through it right now. HOW DOES IT COMPARE TO OTHER ROBOTS? ================================== As you can see from my website, LearnRichly, I’m kind of a learning toy nut. I especially like logic games and programming, so robotics coding is a pretty natural fit. In our house, we have Cozmo (from Anki), Dash (Wonder Workshop), Ozobot, and *3* LEGO Mindstorms kits (the older kids do FIRST Lego League, so they’ve acquired 2 EV3 sets and 1 NXT set). (Ouch, I just realized that I’ve spent over $1000 in toy robots in the last 5 years, yikes. We don’t eat-out or see shows more than a few time per year, so that helps save cash!) UPDATE: See more below about Cozmo in the 8/15 Update.. Which robot do we like the best? So far, LEGO Boost and Dash are the winners, with an edge towards LEGO if you have kids 8 and up and a recommendation for Dash if you have younger kids. Cozmo is small and limited, but more emotive and fun. He’s definitely a “toy” and the others are “learning toys.” Oddly, he’s also capable of real Python programming after a complicated SDK setup, so it’s an eclectic mix. Ozobots are only really useful for the most price-constrained budget; save up and buy a Boost, instead. Why are Dash and Boost the best? Because they give you real coding experience and make it fun. Dash has several apps available and is generally more mature as of right now, but I think Boost should catch up and exceed Dash overall. They both can take LEGO parts for building, but LEGO far and away exceeds Dash in versatility. It can be a factory, guitar, cat or who-knows-what-else that’s coming in the future! I do appreciate Dash as a standalone, start-from-scratch project, but LEGO will be the better choice for most households. Dash has been alone in this space for quite a while, but probably just got dethroned. UPDATE ON AUGUST 15th, 2017 ========================== OK, we've had LEGO Boost for 2 weeks now. We've built the standing robot, the guitar, and the mini-factory. We couldn't get the factory to work and must have done something wrong--we'll come back to it. My son wants to build the rover next. We also had to buy a large organizer set to keep all the pieces--what I didn't realize is how many *unique* pieces there are in this set. The Mindstorms kits have lots of pieces, but they are easier to organize since there are fewer than 100 unique ones. LEGO Boost has over 200 different types of pieces; we ended up using about 60 little divided bins in plastic craft organizers. If I had it to do over again I would buy the Akro Mills 64-drawer organizer like this one: Akro-Mils 64-drawer organizer . They charge too much for the drawer dividers, but I believe another company (stack-on?) has a 48-pack for much cheaper that *supposedly* works with the Akro Mills set, but I haven't verified. Since I wrote the above about Cozmo from Anki, I realize that he now has coding in the app! It's pretty good, too, so he's now much more competitive with LEGO Boost. I will review all of them in a future roundup at my little hobby blog LearnRichly.com, but for now I at least have an in-depth review of LEGO Boost that gives you much more detail than I could put in this Amazon review. Using my 6-criteria scoring scale, the average I came up with was a 4.4 out of 5 stars, so I wish Amazon would allow me to award LEGO Boost a 4.5 star rating instead of my 5 star rating.",
                "review_posted_date": "01 Aug 2017",
                "review_header": "This *is* the robot you've been looking for",
                "review_rating": "5.0 ",
                "review_author": "Steve M. (Check out the Learn Richly 2018 Gift Guide!)"
            },
            {
                "review_comment_count": "",
                "review_text": "I'm giving it 3 stars (upgraded to 4) for the concept (and positive feedback from Lego). My kid (7) loves it and it is a great introduction to robotics and programming. The app is well presented given the vast set of capabilities. They did a good job forcing you to take a gradual approach to learning by \"unlocking\" capabilities as you learn them. That said, there are two issues that others have reported as well. The product is so new that there is no help available with a google search. The problems: 1. The program freezes after the first motion instruction. This is very annoying as you have to restart the app, and it has a long start-up time. Then it works for a few runs and starts freezing again. 2. The programming steps, represented as icons are not documented. Most are obvious (move forward, move back, etc). Others are completely cryptic. Usually you can figure it out just by trying it, but others still remain a mystery or their effect is unclear. Another peeve is that the sound emanates from the tablet, not the robot. They should have added a speaker. I have emailed Lego support on the two issues above. I'll update this review with their response when I get it. EDIT: Lego customer support responded within 24 hours with a thorough email that included a PDF with a \"cheat sheet\" for all of the programming blocks (a.k.a. \"icons\"). Regarding the freezing program issue: they claim to be unaware of it. After some testing here, I'm thinking it might be radio interference with nearby routers and cellphones. I moved to a different room and the issue virtually disappeared. I communicated this to Lego. I'll continue updating with any new information I get from them.",
                "review_posted_date": "07 Aug 2017",
                "review_header": "Fun and educational, but with some kinks.",
                "review_rating": "4.0 ",
                "review_author": "Oscar Kramer"
            },
            {
                "review_comment_count": "",
                "review_text": "How to: Run on Kindle Fire HD 8 Kids Edition I bought a brand new 7th generation - 2017 release, just to run the Lego Boost. (All-New Fire HD 8 Kids Edition Tablet, 8\" HD Display, 32 GB, Kid-Proof Case) Lego Boost, How to set it up & Works great! Step 1. Register and update all Kindle Patches to latest (takes a few reboots) Step 2. Sideload Google Play Store (search how on google, no hacking required) Step 3. Download official Lego Boost App from Google Play Step 4. (Optional) Lock down the tablet with password protection, so the kids can't accidentally purchase from GP Store. Step 5. enable bluetooth to work with Lego finished!",
                "review_posted_date": "17 Sep 2017",
                "review_header": "Run on Kindle Fire HD 8 Kids Edition! - How To -",
                "review_rating": "5.0 ",
                "review_author": "wuber"
            }
        ],
        "url": "http://www.amazon.com/dp/B06Y6JCTKH\n"
    },
    {
        "name": "LEGO Creator Space Shuttle Explorer 31066 Building Kit (285 Piece)",
        "price": "$23.99",
        "ratings": {
            "5 star": "85%",
            "4 star": "8%",
            "3 star": "5%",
            "2 star": "1%",
            "1 star": "1%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I got this for my 5 year old for his birthday. He wants to be an aerospace engineer when he grows up, so naturally he loved it! He loved that the space station had a place for the astronaut to sleep and a robotic arm. The details on the set are awesome and we had fun putting it together. I love that you can transform it again an again.",
                "review_posted_date": "16 Dec 2017",
                "review_header": "so naturally he loved it! He loved that the space station had ...",
                "review_rating": "5.0 ",
                "review_author": "MechInspector"
            },
            {
                "review_comment_count": "",
                "review_text": "Another great LEGO set. My husband and daughter have been working on this one together. You can build three different things with this set. They’ve currently finished the shuttle. It looks great. Was easy to build. And most importantly they had fun doing it together and my daughter has continued her curiousity about space.",
                "review_posted_date": "04 Apr 2018",
                "review_header": "Another great LEGO set",
                "review_rating": "5.0 ",
                "review_author": "alark"
            },
            {
                "review_comment_count": "",
                "review_text": "Built the shuttle today with my daughter and it was a big win. The build is sturdy enough to survive a careful but energetic 2-year old and was fun to build together. The design is clever in the way many Creator sets are and sparked a lot of interesting ideas for other builds. The piece selection is much more interesting and versatile than for the licensed sets. I found this set to be a great value. Once my daughter destroys the shuttle I'm sure we'll come up with great new builds from the pieces.",
                "review_posted_date": "26 Feb 2018",
                "review_header": "Great value, fun build, useful pieces.",
                "review_rating": "5.0 ",
                "review_author": "S. M. Boca"
            },
            {
                "review_comment_count": "",
                "review_text": "I'm a big fan of the shuttle program, have fond memories of watching Atlantis take off back in 01. This little guy is a ton of fun to build and rebuild, it'll be the perfect companion to my new Saturn rocket.",
                "review_posted_date": "02 Jan 2018",
                "review_header": "Perfect size and fun",
                "review_rating": "5.0 ",
                "review_author": "Senor Gato"
            },
            {
                "review_comment_count": "",
                "review_text": "Amazing and sturdy but the fact it only comes with one LEGO figure is a bit sad missed opportunity for LEGO also it was a bit confusing to build I built harder ones but never had as much trouble but the results are worth it but I’m not so sure what the thing on the LEGO guys back is :/ and the satalite thing is hard to fit in it barely fits still great though! And very detailed",
                "review_posted_date": "23 Aug 2018",
                "review_header": "Amazing & sturdy",
                "review_rating": "4.0 ",
                "review_author": "MEOW"
            },
            {
                "review_comment_count": "",
                "review_text": "We loved this set-Robot not included. That was a different set. This was a bday present for my 8 year old autistic son and he LOVED it. He built most of it by himself. We made the shuttle then took it apart and made the moon rider",
                "review_posted_date": "06 Jan 2018",
                "review_header": "We loved this set",
                "review_rating": "5.0 ",
                "review_author": "Beth34"
            },
            {
                "review_comment_count": "",
                "review_text": "The package I received had been repackaged. At this point I do not know if all the parts were inside as the little guy I purchased it for has not yet put the pieces together. However, it is a Lego product, and Lego stands behind their products.",
                "review_posted_date": "06 Jan 2018",
                "review_header": "Nice Lego product",
                "review_rating": "4.0 ",
                "review_author": "SK"
            },
            {
                "review_comment_count": "",
                "review_text": "This is a great set for our 5 year old grandson. He put it together in a few hours pretty much by himself. He hasn't done the other two models as he loves the Space Shuttle.",
                "review_posted_date": "16 Jul 2018",
                "review_header": "Great for a 5 year old",
                "review_rating": "5.0 ",
                "review_author": "Steve"
            }
        ],
        "url": "http://www.amazon.com/dp/B0711MPYJN\n"
    },
    {
        "name": "LEGO Star Wars Episode VIII Kylo Ren's Tie Fighter 75179 Building Kit (630 Piece)",
        "price": "$47.99",
        "ratings": {
            "5 star": "81%",
            "4 star": "15%",
            "3 star": "3%",
            "2 star": "1%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "There are a lot of pieces to this lego set but they are all very organized. They are organized by number and you assemble it per bag number. Keep the order and you will not have any problems. The pieces are fairly sturdy after assembly so you do not have to worry about it falling apart. I was actually really surprised by the sheer size of the lego set. It is not something you can just put on the corner of your desk because the wings are long. They are about 12 inches if not more just from end to end. So if you are planning to put it on a shelf know that it will take a good amount of space. It has a shooting mechanism to shoot two darts from the bottom of the tie fighter. It also comes with 4 lego figures. Kylo, stormtrooper, pilot, and a droid. The details on the stormtrooper and pilot are great! The helmet is huge but very detailed. Overall I was very happy with this. It has great deal, easy to assemble(took about 3 hours), and very detailed in design.",
                "review_posted_date": "25 Jul 2018",
                "review_header": "Pretty Decent Star Wars figure",
                "review_rating": "5.0 ",
                "review_author": "Shadez82"
            },
            {
                "review_comment_count": "",
                "review_text": "Purchased as a gift for my nephew; he ended up getting 3 of this exact set because everyone in the family thought it looked the coolest, and we were right. He put it together in less than 2 days (probably would've been faster if we didn't make him go to bed), and he loves it.",
                "review_posted_date": "24 Jan 2018",
                "review_header": "The coolest ship in the new galaxy",
                "review_rating": "5.0 ",
                "review_author": "TMSjokeman"
            },
            {
                "review_comment_count": "",
                "review_text": "We had lots of fun putting this one together",
                "review_posted_date": "30 Nov 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "J. Wiswell"
            },
            {
                "review_comment_count": "",
                "review_text": "Bought as a gift for my husband. He loved building it. For a frequent LEGO builder it won’t take a super long time to put together but it does look pretty cool! It was also less expensive to buy from amazon than directly from LEGO.",
                "review_posted_date": "15 Feb 2018",
                "review_header": "Great gift",
                "review_rating": "5.0 ",
                "review_author": "Amanda"
            },
            {
                "review_comment_count": "",
                "review_text": "My grandson loves lego star wars and very much enjoyed building it.",
                "review_posted_date": "28 Oct 2017",
                "review_header": "Excellent!!",
                "review_rating": "5.0 ",
                "review_author": "Kindle Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "IMHO it is the best LEGO set from The Last Jedi",
                "review_posted_date": "15 Dec 2017",
                "review_header": "The Best set from the movie",
                "review_rating": "5.0 ",
                "review_author": "Oscar W Romero G"
            },
            {
                "review_comment_count": "",
                "review_text": "Great Christmas present for my son and he loves it. There are also many other things you can make with the Lego pieces other than what is shown.",
                "review_posted_date": "18 Jan 2018",
                "review_header": "Great Gift - Son Loves It!",
                "review_rating": "5.0 ",
                "review_author": "The eBook Investigator"
            },
            {
                "review_comment_count": "",
                "review_text": "Just what my grandson wanted!",
                "review_posted_date": "04 Dec 2017",
                "review_header": "Can’t go wrong with LEGO",
                "review_rating": "5.0 ",
                "review_author": "Cheryl Sutcliffe"
            }
        ],
        "url": "http://www.amazon.com/dp/B0719CL4VD\n"
    },
    {
        "name": "LEGO Ideas NASA Apollo Saturn V 21309 Building Kit",
        "price": "$104.99",
        "ratings": {
            "5 star": "92%",
            "4 star": "4%",
            "3 star": "1%",
            "2 star": "1%",
            "1 star": "2%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I've been eagerly anticipating this release. A realistic LEGO Saturn V rocket that stands 39 inches tall with detachable stages, lunar lander and printed microfigure astronauts. I thought I'd died and gone to LEGO heaven! LEGO could have easily charged $200 for this set but kept the price tag at $119.99 which is probably why it sold out almost immediately, almost everywhere. I got mine direct from Amazon and not a reseller because I got in very early on June 1st and it has been out of stock since but I have seen supplies coming and going at my local LEGO Store. Build took 3 hours 18 minutes (see my unboxing, speed build and review video) and was challenging - not one for the younger kids. Pay careful instructions to the manual as mistakes made early on can be painful to replicate (note the use of pliers in my speed build). The finished result is an unbelievable masterpiece of LEGO engineering and a fitting tribute to the pioneers that took one small step for man, one giant leap for mankind. Check out my video review to see every aspect of the set reviewed in detail.",
                "review_posted_date": "08 Jun 2017",
                "review_header": "The Hottest LEGO Release of 2017 Does Not Disappoint",
                "review_rating": "5.0 ",
                "review_author": "Jeremy Herbert"
            },
            {
                "review_comment_count": "",
                "review_text": "This is such an awesome set. It's my favorite realistic space set and I thought nothing would beat the space shuttle. In my case, it's the perfect father and son build. (It's also great for father-daughter, mother-son/daughter, or just any person who likes to build Lego!) It has some creative building and a lot of great little details. It has a high piece count for the price. And it's a crazy moon rocket! What can possibly compete? I got the frustration-free packaging and was worried that it wouldn't come with the normal Lego box. That concerned me because I wanted the full experience for this set. Thankfully, the frustration free box is a box just big enough to hold the whole set including the regular box. It's shipped in this frustration-free box which is good and bad. It's good because it protects the set without the need of a huge box and padding. It's bad because while it doesn't say what set is inside, it does say \"Lego\" and \"Toys\" all over the box. It was ok, but my children really wondered what was in the box which reduced the surprise. But I don't care how it came--the set is mine! It's 100% worth the hype. I strongly suggest this model. Lego has said they will keep making more through 2018, so you should be able to buy it without paying scalper prices. But I suggest you keep watching Amazon and other retailers and buy one for yourself!",
                "review_posted_date": "13 Sep 2017",
                "review_header": "If you're wondering what the frustration free packaging is...",
                "review_rating": "5.0 ",
                "review_author": "Michael"
            },
            {
                "review_comment_count": "",
                "review_text": "First Lego kit I've done since I was a kid. This set was fun to put together with my daughter and is a great, accurate model as well.",
                "review_posted_date": "22 Jul 2017",
                "review_header": "Awesome",
                "review_rating": "5.0 ",
                "review_author": "Chas J."
            },
            {
                "review_comment_count": "",
                "review_text": "This LEGO Apollo Saturn V is the biggest and imo the best Ideas set to date. Terrific detail and the completed rocket is over 3 feet tall! Can be displayed upright or horizontally on stands. Fun to build and beautiful to display! But... the retail price of this item is $119.99. It is a new release and very popular, sold out on Amazon and the LEGO site as soon as it was available. It should be in stock at the regular price again once they catch up to demand, so don't shell out extra money to these third party \"marketplace\" sellers unless you have money to burn and don't care about wasting it. And even then it's good idea to pass and not reward these sellers... they are the reason the set is out of stock, they buy them all up so they can turn around and gouge you! Cheers!",
                "review_posted_date": "01 Jun 2017",
                "review_header": "Awesome set but beware the price!",
                "review_rating": "5.0 ",
                "review_author": "Brandon"
            },
            {
                "review_comment_count": "",
                "review_text": "Received the kit, prompted some drooling (as required), and began building! Only took a couple hours, but I savored every second! Now stands proud next to my Revell 1:144 Saturn V and LEGO Discovery!",
                "review_posted_date": "04 Jun 2017",
                "review_header": "Top Notch LEGO Ideas Kit!",
                "review_rating": "5.0 ",
                "review_author": "Jonathan W. Atkinson"
            },
            {
                "review_comment_count": "",
                "review_text": "Truly a fantastic kit. One of the best Legos ever made. Assembly took me about 7 hours (!), which for the price is quite a good return on price. The rocket stages hide an enormous amount of detail inside their tube bodies. This kit is far more than just the outside of a rocket, but only those who participate in building it will discover the joy of the little connectors, thrusters, and doodads inside. It is incredibly tall. Have the conversation with your family about where to store it before purchase, to avoid heart ache. It's also incredibly sturdy. It takes quite a lot of force to separate the sections, but this also means you can trust it'll hold itself together very well.",
                "review_posted_date": "30 Dec 2017",
                "review_header": "Truly a fantastic kit. One of the best Legos ever made",
                "review_rating": "5.0 ",
                "review_author": "jon"
            },
            {
                "review_comment_count": "",
                "review_text": "Just finished building this last night in a 5 hour cream soda and twizzler building binge. It's LEGO. Good quality, the design makes sense and it was a lot of fun. It is to scale, so if you're expecting to play with the mini-figs, prepare to be disappointed. They are about a 1/4 inch high. The finished set is very tall (or long depending on how you choose to display), unless you choose to display as separate booster units. Instructions were easy to understand, and the booklet is the size of a magazine and contains some really great supplementary material about the Apollo mission, pictures, and information about the process of design and build of both the real thing and the lego version. Worth the money. As it has already sold out from LEGO once, buy now to ensure you don't lose access to such a unique set.... these types of sets always go up in value.",
                "review_posted_date": "28 Dec 2017",
                "review_header": "So.very.cool!",
                "review_rating": "5.0 ",
                "review_author": "trailblder"
            }
        ],
        "url": "http://www.amazon.com/dp/B071G3QMS2\n"
    },
    {
        "name": "LEGO Ninjago Movie Fire Mech 70615 Building Kit (944 Piece)",
        "price": "$46.99",
        "ratings": {
            "5 star": "85%",
            "4 star": "5%",
            "3 star": "5%",
            "2 star": "2%",
            "1 star": "3%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Bought for my 6 year old grandson. He loved putting it together. With intense focus it only took him 20 days.",
                "review_posted_date": "15 Jan 2018",
                "review_header": "Six year old loves it.",
                "review_rating": "5.0 ",
                "review_author": "Bruce"
            },
            {
                "review_comment_count": "",
                "review_text": "Like all the ninjago legos - it falls apart if you actually try and play with it. But my 7 year old built himself and loved it but is constantly getting frustrated when peices fall off every time you move it.",
                "review_posted_date": "31 Dec 2017",
                "review_header": "Like all the ninjago legos - it falls apart if ...",
                "review_rating": "2.0 ",
                "review_author": "WhyMe"
            },
            {
                "review_comment_count": "",
                "review_text": "I spent 3 hours to put it altogether and sent it to my 5 year old nephew, he loves it very much and give me a big kiss! Totally worth the money!",
                "review_posted_date": "01 May 2018",
                "review_header": "A perfect toy to bribe a little boy!",
                "review_rating": "5.0 ",
                "review_author": "MIAO"
            },
            {
                "review_comment_count": "",
                "review_text": "Amazing LEGO I think this is the best LEGO my son make He is very happy I need buy the collection 🙂👌",
                "review_posted_date": "25 Jan 2018",
                "review_header": "WOW!!!amazing",
                "review_rating": "5.0 ",
                "review_author": "Yajaira C"
            },
            {
                "review_comment_count": "",
                "review_text": "This was really difficult to get this holiday season. My son loves it and has been playing with it for days.",
                "review_posted_date": "28 Dec 2017",
                "review_header": "This was really difficult to get this holiday season. ...",
                "review_rating": "5.0 ",
                "review_author": "Joy de Leyer"
            },
            {
                "review_comment_count": "",
                "review_text": "My son loved this and put it together as soon as he opened the gift on his birthday!",
                "review_posted_date": "13 Nov 2017",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "R K Early"
            },
            {
                "review_comment_count": "",
                "review_text": "I got this for my 8yo son this past Christmas. It's really neat and has great detail. It stands up on it's own very well and all the extra figures are a bonus. Great Lego mech!",
                "review_posted_date": "04 Jan 2018",
                "review_header": "Very cool!",
                "review_rating": "5.0 ",
                "review_author": "Lindsay"
            },
            {
                "review_comment_count": "",
                "review_text": "Very detailed, large assembly. Spent near 9 hours spread over a week with my 10 yr old daughter assembling this massive mech. My one complaint is that most the joints and some of thesections are extremely frail, resulting in a need to reassemble certain sections numerous times before finishing, or any time you move it.",
                "review_posted_date": "13 Apr 2018",
                "review_header": "Fun, big, frail",
                "review_rating": "4.0 ",
                "review_author": "Lucid Drem"
            }
        ],
        "url": "http://www.amazon.com/dp/B071NWGNQ2\n"
    },
    {
        "name": "LEGO Star Wars VIII BB-8 75187 Building Kit (1106 Piece)",
        "price": "$99.95",
        "ratings": {
            "5 star": "91%",
            "4 star": "7%",
            "3 star": "0%",
            "1 star": "2%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "This is a great lego set with nice internal gears for movement that any Star Wars fan will love. It took my 10 year old son about 8 hours to assemble it and he only needed my help for 2 pages and that was minor stuff. It's a collector's item set so it includes a nice display stand and a minifig of BB8. Please view the video (that he made himself) showing the features of this Lego set and will show you the scale of the set.",
                "review_posted_date": "27 Sep 2017",
                "review_header": "Very nice Lego set for the Star Wars fan,",
                "review_rating": "5.0 ",
                "review_author": "Jay"
            },
            {
                "review_comment_count": "",
                "review_text": "I take care of my elderly father and I asked his pain management doctor if she could think of anything for him to keep his hands and mind busy, she suggested Lego's and I thought that's a wicked cool idea because I have tried everything I could think of, small wood work things, word find books, coloring books, puzzles and now Lego's. So to encourage him to work on his very simple Lego set I bought myself this BB-8 set. I was completely ignorant as to how much Lego’s had advanced. When I opened the BB-8 box I was stunned and in shock. I am 47 and I have not 'played' with Lego's in a very, very long time so I got him a very simple set and I bought this 'hell monster' that I love & am still working on, so I give it 5 Stars because it is awesome and it is not Lego’s of old, when I opened it “It’s a trap!” were the first words that popped into my head! If you are an older person do not buy Lego's blindly. REALLY read the description and prepare yourself for the shock! LOL. It truly is an amazing project and it is looking beautiful so far. If you enjoy a challenge I highly recommend. BTW my dad hasn't even touched his little truck Lego. SMH",
                "review_posted_date": "23 Nov 2017",
                "review_header": "she suggested Lego's and I thought that's a wicked cool idea because I have tried everything I could think ...",
                "review_rating": "5.0 ",
                "review_author": "Unbreakable0121"
            },
            {
                "review_comment_count": "",
                "review_text": "AMAZING Lego set. Our 10 yr old loved this. It took him several days over Christmas Break to put together. There were several times he got frustrated and needed to take a break....life lesson. Mind blown the things you can accomplish with Legos...mechanical components too!",
                "review_posted_date": "30 Dec 2017",
                "review_header": "AMAZING Lego set",
                "review_rating": "5.0 ",
                "review_author": "Just Janet"
            },
            {
                "review_comment_count": "",
                "review_text": "I am a huge LEGO fan, but because LEGO can be pricey, I generally wait for a sale, this set is no exception, cool looking but pricey, it took me about a couple of hours to build this, that included taking care of my kids, I did have one area that Just didn’t want to fit, but all in all a great kit.",
                "review_posted_date": "13 Dec 2017",
                "review_header": "LEGO fan",
                "review_rating": "4.0 ",
                "review_author": "Tom"
            },
            {
                "review_comment_count": "",
                "review_text": "Got it for my 8 year old son who loves Legos. He was super exited to get the set. My kid has autism and Legos seems to be the only toy that keeps his attention. This set was a bit more complicated then your usual Legos, but my son was able to put it all together in two days. He loves that you can twist and turn the knobs and the figure moves it’s head and opens the front “hatch”.",
                "review_posted_date": "05 Jan 2018",
                "review_header": "He was super exited to get the set",
                "review_rating": "5.0 ",
                "review_author": "KatushaLA"
            },
            {
                "review_comment_count": "",
                "review_text": "The way the head wiggles can be very similar to the movie BB8, it's very unique and very cool. This feature of the kit was pretty surprising, put it over the top for me in an otherwise relatively mundane build. The 'torch door' opens when extending the torch but does not close when the torch is retracted, which seems kinda half-baked to me. The wiggly head more than compensates to me, a pretty great kit overall.",
                "review_posted_date": "05 Jan 2018",
                "review_header": "You can make BB8's head bobble, just like in the movie!",
                "review_rating": "5.0 ",
                "review_author": "Slabshaft"
            },
            {
                "review_comment_count": "",
                "review_text": "Fabulous interactive kit from Lego that transforms into the beloved BB8 robot character from the latest films in the Star War series. Although the age range is given as starting at 10, it is still do-able for younger kids (with parental help).",
                "review_posted_date": "22 Jan 2018",
                "review_header": "Great kit",
                "review_rating": "5.0 ",
                "review_author": "KasaC"
            },
            {
                "review_comment_count": "",
                "review_text": "A lot of fun to put together. The bobbing action of BB-8's head is really cool and cleverly done with the mechanism. He also offers his cutting torch with another mechanism. It comes with a stand that holds him and also a mini-figure BB-8.",
                "review_posted_date": "18 Dec 2017",
                "review_header": "BB-8 is way cool!",
                "review_rating": "5.0 ",
                "review_author": "P. Wood"
            }
        ],
        "url": "http://www.amazon.com/dp/B071S29664\n"
    },
    {
        "name": "LEGO Ninjago Movie Water Strider 70611 Building Kit (494 Piece)",
        "ratings": {
            "5 star": "85%",
            "4 star": "10%",
            "3 star": "1%",
            "2 star": "1%",
            "1 star": "3%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I’m writing this review from the point of view of an adult fan of LEGO. The model itself is great—fun to put together, and looks fantastic. But the real reason I’m even bothering to write this review is that this is a fantastic deal if you are looking to kit-bash (use the pieces for other projects). There is a large variety of interesting pieces here, including four minifigures and some weapons, things you won’t ever get in the generic tubs of bricks that LEGO also sells. And here’s the kicker—with the current amazon discount (20% off MSRP), this set works out to be under the magical bar of $0.05 per piece. It’s the only set for sale directly from amazon (as opposed to third party sellers) that has that distinction, period, including the generic tubs of LEGO bricks specifically designed for creative play. The deal is so good, with such great pieces, that I bought three copies of this set: one to build and display, and the other two to cannibalize for parts.",
                "review_posted_date": "30 Jan 2018",
                "review_header": "Currently the lowest cost per piece of any themed set",
                "review_rating": "5.0 ",
                "review_author": "majikthise"
            },
            {
                "review_comment_count": "",
                "review_text": "Nice set. Good figure selection. Build was repetitive, building the legs 4 times. But set looks great assembled. Legs are locked in place at the center section, so the legs aren't as poseable as they could have been. And the cockpit screen was not hinged, which I personally hate in models. Sides of the cockpit aren't held in place by enough studs, so they come lose too easy when the screen is not on the model. But otherwise, a very nice set.",
                "review_posted_date": "09 Aug 2017",
                "review_header": "Nice set. Good figure selection",
                "review_rating": "4.0 ",
                "review_author": "Miles A."
            },
            {
                "review_comment_count": "",
                "review_text": "My 6 year old absolutely loves legos and LEGO ninjago has been a favorite lately. He’s able to put these together himself with very little help. This particular set comes with 7 bags including some LEGO men. They are really cool and will keep you busy for hours! Would definitely recommend these to any LEGO lover!",
                "review_posted_date": "28 Jan 2018",
                "review_header": "LEGO ninjago",
                "review_rating": "5.0 ",
                "review_author": "miss218"
            },
            {
                "review_comment_count": "",
                "review_text": "Got this for my 7 year old who for the most part did a fair job building on his own but the lego set isn’t the clearest on instructions when it came to the legs. With some help, he was able to get through it. He was very happy with it.",
                "review_posted_date": "28 Nov 2017",
                "review_header": "7 Year old",
                "review_rating": "4.0 ",
                "review_author": "thedharmalife"
            },
            {
                "review_comment_count": "",
                "review_text": "6 yr old grandson went crazy over this. Be advised that there are over 400 parts and many are very small. It took a total of 4 hours to put it together but that may have been related to a 6 yr old in the control lead. It shoots little blue clear \"missiles\" that can get lost very easily if not aimed in a direction that makes them easy to find. Avoid carpet. Great fun and well built when finished. Highly recommend.",
                "review_posted_date": "05 May 2018",
                "review_header": "Give yourself and co-builders plenty of time.",
                "review_rating": "5.0 ",
                "review_author": "Harrietta"
            },
            {
                "review_comment_count": "",
                "review_text": "A bit complicated for age range, but price is fantastic at $24. The Lego engineers / designers went nuts with this one, great features!",
                "review_posted_date": "12 Nov 2017",
                "review_header": "Genius Lego Creation",
                "review_rating": "5.0 ",
                "review_author": "PDXreview"
            },
            {
                "review_comment_count": "",
                "review_text": "I've got a soft spot for 'mech kits, even if I don't much care for the Ninjago theme. It's an okay build -- the vehicle core is the interesting part, and the four legs are all identical, so there's a bit of repetition. My kids love this one and the legs are sturdy enough where they're not pulling them off every time they try to change the pose. Definitely worth the money.",
                "review_posted_date": "22 Mar 2018",
                "review_header": "Somewhat repetitive build, but a good set.",
                "review_rating": "4.0 ",
                "review_author": "D. Bailey"
            },
            {
                "review_comment_count": "",
                "review_text": "Was looking for a LEGO set for a gift, and this one was simply the biggest bang for the buck. It has a lot of pieces, and makes a pretty impressive robot thing that any kid would love. It is interesting that it is only about half the price, on average around the web, as any other LEGO sets of comparable size. Can't really figure out how they price the things, but this was a good deal!",
                "review_posted_date": "10 Aug 2018",
                "review_header": "Good LEGO set for the price!",
                "review_rating": "4.0 ",
                "review_author": "Radio127"
            }
        ],
        "url": "http://www.amazon.com/dp/B071VNCXQV\n"
    },
    {
        "name": "LEGO Boost Creative Toolbox 17101 Building and Coding Kit (847 Pieces)",
        "price": "$159.95",
        "ratings": {
            "5 star": "68%",
            "4 star": "14%",
            "3 star": "4%",
            "2 star": "5%",
            "1 star": "9%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "OVERALL CONCLUSION ================== LEGO boost is 80% of the learning at 50% of the cost and 20% of the hassle of LEGO’s fancier Mindstorms product. LEGO Boost compares really well to all other competing robots out there, so if you want your kid to know about coding, robotics, mechanics or technology, it’s a really easy choice. The age range is spot-on: 7 to 12 years old seems just right. TOP PROS: 1) Great value for what you get; 2) Extensive models for a lot of fun; 3) Painless setup so that kids can use the app and Bluetooth connection easily. TOP CONS: 1) Needs an iPad or Android tablet, which can triple the cost; 2) Limited accessories and other sensors/motors so far; 3) App can be very confusing at times and the “unlocking” of levels is irritating WHAT CAN LEGO BOOST DO? ====================== You can build 5 different, intricate projects right out of the box. LEGO included a huge assortment of great parts so that you can build a standing robot, a guitar, a “factory”, a cat, and a horizontal rover bot. Each model is part toy and part experiment because the app has included code that makes the characters lively and interactive while leaving room for customization. All the sounds and processing is done by your tablet, so that’s a smart way to save costs and make the “brain” brick really simple (which LEGO calls the “Move Hub”). The LEGO Boost app guides you through building and programming each robot in a set of challenges that are unlocked as you go. My 7-year-old and I could only figure out how to do Vernie the tall robot so far, which was sad because he wanted to start with the guitar or factory. This is minor bump in the road, though, because I envision this being a popular toy for a very long time. The fact that the Bluetooth setup was so painless (no pairing on iOS, it was like magic) makes this much easier to deal with than other robots like Cozmo. NOTE: If your app crashes, power off your iPad completely. This worked great for me. I’ve noticed that upon installation, some apps need a power cycle to work their best. I don’t know if this is a memory leak in the iPad or what. I’m running the app on a 3-year-old iPad Air 1 (not 2) and it works great. Anything newer should be fine, and LEGO has a device check section on their website. IS LEGO BOOST FUN AND EDUCATIONAL? ================================ For sure, this product is a ton of fun and teaches a lot about coding/logic, problem-solving, and creativity. My younger two kids, ages 4 and 7, are over-the-moon-excited about it and have been counting down the days until it arrived on August 1st. My 7-year-old already spent three hours building the first robot and he was completely enthralled. I was especially impressed by the robot’s head motion and the intricacy of the gears used in this model. The app has been fun to go through, but we’re only partially through it right now. HOW DOES IT COMPARE TO OTHER ROBOTS? ================================== As you can see from my website, LearnRichly, I’m kind of a learning toy nut. I especially like logic games and programming, so robotics coding is a pretty natural fit. In our house, we have Cozmo (from Anki), Dash (Wonder Workshop), Ozobot, and *3* LEGO Mindstorms kits (the older kids do FIRST Lego League, so they’ve acquired 2 EV3 sets and 1 NXT set). (Ouch, I just realized that I’ve spent over $1000 in toy robots in the last 5 years, yikes. We don’t eat-out or see shows more than a few time per year, so that helps save cash!) UPDATE: See more below about Cozmo in the 8/15 Update.. Which robot do we like the best? So far, LEGO Boost and Dash are the winners, with an edge towards LEGO if you have kids 8 and up and a recommendation for Dash if you have younger kids. Cozmo is small and limited, but more emotive and fun. He’s definitely a “toy” and the others are “learning toys.” Oddly, he’s also capable of real Python programming after a complicated SDK setup, so it’s an eclectic mix. Ozobots are only really useful for the most price-constrained budget; save up and buy a Boost, instead. Why are Dash and Boost the best? Because they give you real coding experience and make it fun. Dash has several apps available and is generally more mature as of right now, but I think Boost should catch up and exceed Dash overall. They both can take LEGO parts for building, but LEGO far and away exceeds Dash in versatility. It can be a factory, guitar, cat or who-knows-what-else that’s coming in the future! I do appreciate Dash as a standalone, start-from-scratch project, but LEGO will be the better choice for most households. Dash has been alone in this space for quite a while, but probably just got dethroned. UPDATE ON AUGUST 15th, 2017 ========================== OK, we've had LEGO Boost for 2 weeks now. We've built the standing robot, the guitar, and the mini-factory. We couldn't get the factory to work and must have done something wrong--we'll come back to it. My son wants to build the rover next. We also had to buy a large organizer set to keep all the pieces--what I didn't realize is how many *unique* pieces there are in this set. The Mindstorms kits have lots of pieces, but they are easier to organize since there are fewer than 100 unique ones. LEGO Boost has over 200 different types of pieces; we ended up using about 60 little divided bins in plastic craft organizers. If I had it to do over again I would buy the Akro Mills 64-drawer organizer like this one: Akro-Mils 64-drawer organizer . They charge too much for the drawer dividers, but I believe another company (stack-on?) has a 48-pack for much cheaper that *supposedly* works with the Akro Mills set, but I haven't verified. Since I wrote the above about Cozmo from Anki, I realize that he now has coding in the app! It's pretty good, too, so he's now much more competitive with LEGO Boost. I will review all of them in a future roundup at my little hobby blog LearnRichly.com, but for now I at least have an in-depth review of LEGO Boost that gives you much more detail than I could put in this Amazon review. Using my 6-criteria scoring scale, the average I came up with was a 4.4 out of 5 stars, so I wish Amazon would allow me to award LEGO Boost a 4.5 star rating instead of my 5 star rating.",
                "review_posted_date": "01 Aug 2017",
                "review_header": "This *is* the robot you've been looking for",
                "review_rating": "5.0 ",
                "review_author": "Steve M. (Check out the Learn Richly 2018 Gift Guide!)"
            },
            {
                "review_comment_count": "",
                "review_text": "I'm giving it 3 stars (upgraded to 4) for the concept (and positive feedback from Lego). My kid (7) loves it and it is a great introduction to robotics and programming. The app is well presented given the vast set of capabilities. They did a good job forcing you to take a gradual approach to learning by \"unlocking\" capabilities as you learn them. That said, there are two issues that others have reported as well. The product is so new that there is no help available with a google search. The problems: 1. The program freezes after the first motion instruction. This is very annoying as you have to restart the app, and it has a long start-up time. Then it works for a few runs and starts freezing again. 2. The programming steps, represented as icons are not documented. Most are obvious (move forward, move back, etc). Others are completely cryptic. Usually you can figure it out just by trying it, but others still remain a mystery or their effect is unclear. Another peeve is that the sound emanates from the tablet, not the robot. They should have added a speaker. I have emailed Lego support on the two issues above. I'll update this review with their response when I get it. EDIT: Lego customer support responded within 24 hours with a thorough email that included a PDF with a \"cheat sheet\" for all of the programming blocks (a.k.a. \"icons\"). Regarding the freezing program issue: they claim to be unaware of it. After some testing here, I'm thinking it might be radio interference with nearby routers and cellphones. I moved to a different room and the issue virtually disappeared. I communicated this to Lego. I'll continue updating with any new information I get from them.",
                "review_posted_date": "07 Aug 2017",
                "review_header": "Fun and educational, but with some kinks.",
                "review_rating": "4.0 ",
                "review_author": "Oscar Kramer"
            },
            {
                "review_comment_count": "",
                "review_text": "How to: Run on Kindle Fire HD 8 Kids Edition I bought a brand new 7th generation - 2017 release, just to run the Lego Boost. (All-New Fire HD 8 Kids Edition Tablet, 8\" HD Display, 32 GB, Kid-Proof Case) Lego Boost, How to set it up & Works great! Step 1. Register and update all Kindle Patches to latest (takes a few reboots) Step 2. Sideload Google Play Store (search how on google, no hacking required) Step 3. Download official Lego Boost App from Google Play Step 4. (Optional) Lock down the tablet with password protection, so the kids can't accidentally purchase from GP Store. Step 5. enable bluetooth to work with Lego finished!",
                "review_posted_date": "17 Sep 2017",
                "review_header": "Run on Kindle Fire HD 8 Kids Edition! - How To -",
                "review_rating": "5.0 ",
                "review_author": "wuber"
            }
        ],
        "url": "http://www.amazon.com/dp/B072MK1PDV\n"
    },
    {
        "name": "LEGO City Coast Guard Sea Rescue Plane 60164 Building Kit (141 Piece)",
        "price": "$11.99",
        "ratings": {
            "5 star": "91%",
            "4 star": "8%",
            "3 star": "1%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I fly model airplanes and my son always wants me to get one with floats even though we are nowhere near a lake, so I snapped this up what I saw it. He's building it now and seems very happy with it so its a win in my book.",
                "review_posted_date": "17 Apr 2018",
                "review_header": "Cool",
                "review_rating": "5.0 ",
                "review_author": "Frank H"
            },
            {
                "review_comment_count": "",
                "review_text": "Classic Lego quality. We always purchase Legos for rainy days on the boat, so of course it made sense to buy a sea plane and rescue set. They are lego bricks, high quality, came shipped great, again not much to say since it's Lego Brand.",
                "review_posted_date": "28 Sep 2017",
                "review_header": "Typical Lego Quality",
                "review_rating": "5.0 ",
                "review_author": "Tom"
            },
            {
                "review_comment_count": "",
                "review_text": "Shipped to my grand-nephew going thru extensive cancer treatments. He loved it. Good in hospital activities. Challenging and rewarding",
                "review_posted_date": "23 Apr 2018",
                "review_header": "He loved it. Good in hospital activities",
                "review_rating": "5.0 ",
                "review_author": "JMS Saint Petersburg FL"
            },
            {
                "review_comment_count": "",
                "review_text": "Didnt realize the back door of the plane opens to store the jet ski. My kid loved it for Christmas and I had fun putting it together for him.",
                "review_posted_date": "05 Jan 2018",
                "review_header": "My kid loved it for Christmas and I had fun putting it ...",
                "review_rating": "5.0 ",
                "review_author": "Chris"
            },
            {
                "review_comment_count": "",
                "review_text": "These are so fun! I bought them for my 5 year old nephew. He needed a little help building them but got most of the way on his own. Great gift for boys and girls!",
                "review_posted_date": "15 Dec 2017",
                "review_header": "These are so fun! I bought them for my 5 year old ...",
                "review_rating": "5.0 ",
                "review_author": "Laura"
            },
            {
                "review_comment_count": "",
                "review_text": "My 5 year old grandson, who is obsessed with rescue vehicles, loves this. He immediately put it together (with help). Clearly one of the better choices I have made to add to his Lego collection.",
                "review_posted_date": "01 Oct 2017",
                "review_header": "excellent set",
                "review_rating": "5.0 ",
                "review_author": "Jane"
            },
            {
                "review_comment_count": "",
                "review_text": "Bought this for my 4 yr old grandson. He loves it. He loves planes and kites. Now I have to look for a lego kite... Would buy this again...",
                "review_posted_date": "16 Oct 2017",
                "review_header": "Great Plane",
                "review_rating": "5.0 ",
                "review_author": "gramatt"
            },
            {
                "review_comment_count": "",
                "review_text": "Purchased as s gift for my nephew. He loved it and started putting it together immediately",
                "review_posted_date": "18 Mar 2018",
                "review_header": "Wo,fer birthdsy gift",
                "review_rating": "5.0 ",
                "review_author": "salemsister"
            }
        ],
        "url": "http://www.amazon.com/dp/B072PL3P8H\n"
    },
    {
        "name": "LEGO City Pickup & Caravan 60182 Building Kit (344 Piece)",
        "price": "$23.99",
        "ratings": {
            "5 star": "87%",
            "4 star": "7%",
            "3 star": "3%",
            "2 star": "1%",
            "1 star": "2%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "This is a fun basic set. The camper opens so little fingers can get inside. It attaches to the truck well. My 9 year old super loves it! Plus I paid $24 and I felt like that was a good deal...with Legos being so expensive I try to get sets that will get played with over and over again.",
                "review_posted_date": "09 May 2018",
                "review_header": "Great basic set!",
                "review_rating": "5.0 ",
                "review_author": "Lirpaleigh"
            },
            {
                "review_comment_count": "",
                "review_text": "Really fun ! Nice detail and a decent price . Easy for younger kids to build . Study enough for them to play with after .",
                "review_posted_date": "20 Feb 2018",
                "review_header": "Really fun! Nice detail and a decent price",
                "review_rating": "5.0 ",
                "review_author": "Bella"
            },
            {
                "review_comment_count": "",
                "review_text": "GREAT set! Lego never disappoints. This was so much fun for our 5 year old to assemble and he loves this people included and little extras. Really cute set!",
                "review_posted_date": "19 Mar 2018",
                "review_header": "Great set! 5 year old loves it!",
                "review_rating": "5.0 ",
                "review_author": "chaqueequa"
            },
            {
                "review_comment_count": "",
                "review_text": "This was gift for my grand son. He has many Legos and loves to play with them.",
                "review_posted_date": "07 Mar 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "Dennis J. Zipay"
            },
            {
                "review_comment_count": "",
                "review_text": "Received fast to my 8 year old grandson and he loved it. He put it together himself! I know he is a little ahead but he truly loved his birthday gift from grandma!! Very lifelike and natural and since his grandparents are campers he uses it with great immagination. Highly recommend!!",
                "review_posted_date": "05 Nov 2018",
                "review_header": "Eight year old loved it and put it together!!",
                "review_rating": "5.0 ",
                "review_author": "D. H."
            },
            {
                "review_comment_count": "",
                "review_text": "You can't go wrong with Legos. High quality, innovative design, and a fun educational activity for kids. My son really loved this one...the camper hooks up to the truck nicely.",
                "review_posted_date": "13 Mar 2018",
                "review_header": "It's Lego! What do you expect?",
                "review_rating": "5.0 ",
                "review_author": "Sarah Oh"
            },
            {
                "review_comment_count": "",
                "review_text": "This is a Christmas present for my nephew, but it is absolutely adorable! I love the little characters and the fish/crab that come with it! I am so excited for him to open it he loves to go camping every year! I was super excited to find this!",
                "review_posted_date": "20 Oct 2018",
                "review_header": "Adorable",
                "review_rating": "5.0 ",
                "review_author": "Nicole"
            },
            {
                "review_comment_count": "",
                "review_text": "Completely surprised how well built this Lego set is. It's a must have for the Lego fan in your household. I Really like building it and my son still has it built and plays with it often. So far I think it's one of his favorites. Another must have Lego set.",
                "review_posted_date": "25 Apr 2018",
                "review_header": "One of a kind camper and truck.",
                "review_rating": "5.0 ",
                "review_author": "Jessy M."
            }
        ],
        "url": "http://www.amazon.com/dp/B075LVVYWS\n"
    },
    {
        "name": "LEGO Creator 3in1 Mythical Creatures 31073 Building Kit (223 Piece)",
        "price": "$11.99",
        "ratings": {
            "5 star": "86%",
            "4 star": "11%",
            "3 star": "1%",
            "1 star": "2%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Age says 7 to 12, but my six year old grandson did all three images beautifully. It was difficult, and he had a few frustrating moments, but he stuck with it and did it all by himself. I only wish there were more low price legos out there that I could buy.",
                "review_posted_date": "24 Feb 2018",
                "review_header": "FINISHED PRODUCT GREAT!",
                "review_rating": "5.0 ",
                "review_author": "Frances Hunt"
            },
            {
                "review_comment_count": "",
                "review_text": "My son owns most of the 3 in 1 lego sets available and this one is his second favorite (the dinosaur set was his favorite, but not by much). He was 4 when he got it and you enjoyed not only building it, but also playing with it as an action figure. The claw pieces are a little hard to be put together with his little hands but otherwise, he was able to build most of it all by himself.",
                "review_posted_date": "15 Aug 2018",
                "review_header": "My son's favorite 3 in 1 lego set",
                "review_rating": "5.0 ",
                "review_author": "hitomitojite"
            },
            {
                "review_comment_count": "",
                "review_text": "My son really enjoyed it! He loved being able to take it apart and create a new toy with slightly altered instructions. I will be buying more of these 3 in 1 sets for sure!",
                "review_posted_date": "10 Jul 2018",
                "review_header": "Super cool, basically three lego sets in one!",
                "review_rating": "5.0 ",
                "review_author": "Brittney Youmans"
            },
            {
                "review_comment_count": "",
                "review_text": "My 5 year old built all of the three creatures on his own, but especially he liked the dragon and the fact it can \"pour\" fire! And after that it's time for firefighters or paw patrol to take care of it :) He had mighty dinosaurs 3 in 1 creative set before and enjoyed it a lot, built and rebuilt almost every day for a long time, and hopefully this set will have the same fate. Actually he enjoyed this set more than other sets, which allow to build simultaneously more but smaller things.",
                "review_posted_date": "15 Nov 2018",
                "review_header": "Good set",
                "review_rating": "5.0 ",
                "review_author": "Astrik Shahkhatuni"
            },
            {
                "review_comment_count": "",
                "review_text": "My son enjoyed putting this together, and it looks cool assembled. Enough of a challenge for a 10yo that it kept him occupied for awhile but not so difficult he couldn’t do it himself.",
                "review_posted_date": "15 Jul 2018",
                "review_header": "10yo loved it",
                "review_rating": "5.0 ",
                "review_author": "Laura McCarthy"
            },
            {
                "review_comment_count": "",
                "review_text": "Shame on you Lego! One month after some parts start to brake on half already!! Especially small single pieces((they are not last long enough. Every Lego set in my son’s collection have 5-10 broken pieces(((",
                "review_posted_date": "11 Oct 2018",
                "review_header": "Poor quality plastic( pieces keep breaking nonstop (",
                "review_rating": "1.0 ",
                "review_author": "Mila Murphy"
            },
            {
                "review_comment_count": "",
                "review_text": "So far this lego set is the best for its price. It might seem a little small at first, but when you build it, it looks bigger. It has awesome joints allowing it to do a wide variety of poses.",
                "review_posted_date": "10 May 2018",
                "review_header": "AMAZING VALUE!!!",
                "review_rating": "5.0 ",
                "review_author": "Silvina"
            },
            {
                "review_comment_count": "",
                "review_text": "A great set of legos. My son loves to be able to make all 3 creatures.",
                "review_posted_date": "20 Jan 2018",
                "review_header": "Great set of legos",
                "review_rating": "5.0 ",
                "review_author": "M ohammad Mahdi"
            }
        ],
        "url": "http://www.amazon.com/dp/B075RFBKNS\n"
    },
    {
        "name": "LEGO Star Wars Ultimate Millennium Falcon 75192 Building Kit (7541 Pieces)",
        "price": "$799.95",
        "ratings": {
            "5 star": "85%",
            "4 star": "7%",
            "3 star": "3%",
            "2 star": "2%",
            "1 star": "3%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "You already know if a $800 box of plastic bricks that will resemble the Millennium Falcon when finished is something up your alley. If you are that sort of person, you won't be disappointed in it. Thing is massive. The instructions actually have images to show you how to properly lift it and move it around. I clocked roughly 21 hrs total build time. I'm not sure if that's fast or slow. Make sure you not only have somewhere spacious to build it but also somewhere in mind to put it before starting. One look at the manual (see pic) when you take it out of the box and you'll get an idea of what you're in for.",
                "review_posted_date": "04 Mar 2018",
                "review_header": "A giant LEGO Millennium Falcon.",
                "review_rating": "5.0 ",
                "review_author": "Brain"
            },
            {
                "review_comment_count": "",
                "review_text": "I won this hunk of junk in a card game. Fastest ship in the galaxy if you ask me. A little rough around the edges but hey it’s got a working Dejarik board so that’s sweet. Has panels for hiding stuff from Imperial inspections and the seats in the cockpit recline a good amount. Easily meets the advertised 12 parsec jump time. Downsides: she’s real ugly. If your trying to get a date with like a princess or something, she’s probably not going to be too impressed. And there’s this distinctive wet Wookie smell eminating from it. Not sure if it’s something a couple dozen air fresheners can take care of or not.",
                "review_posted_date": "01 Mar 2018",
                "review_header": "Got it where it counts...",
                "review_rating": "5.0 ",
                "review_author": "Zach & Anna"
            },
            {
                "review_comment_count": "",
                "review_text": "A word of warning, the box this thing ships in is massive, it barely fit in my trunk. I opened up the shipping box to find another box, and inside that box was yet another box, and inside that box was four more boxes. Each of the four boxes contained like 15 bags of pieces, the boxes were not packaged by stage, instead i had to sort through all four. I started around 330 on a friday. Im still not done, but coming up on about 18 hours. If you are like me and grew up with legos and love star wars, but only got the sets that your parents could afford to get you but always coveted the big expensive ones, then this is definitely up your alley. Time consuming, fun to build, and incredibly detailed. I had been waiting for this thing to be available for about 8 months, and as soon as i saw it was in stock, i jumped on it. THIS is a true collectors item for both Lego and Star Wars fans. The only dilemma i have right now is where i am going to put it. If you are a parent, and thinking about buying this for your kids, think twice because this is NOT a toy. I have two kids but bought this for myself. It would definitely be a great family build project though. This build has so far been tedious, but an absolute blast and i cant wait for the finished product!",
                "review_posted_date": "10 Jun 2018",
                "review_header": "You better be willing to sacrifice a piece of furniture for this monster",
                "review_rating": "5.0 ",
                "review_author": "Daniel and Amanda Jessen"
            },
            {
                "review_comment_count": "",
                "review_text": "I don't know how you can NOT give this five stars! If you can get your hands on this set, get it! It is the largest production set ever! It is HUGE! The box itself is more like an end table than anything else. This will provide many hours of fun! This is not for beginners or young children.",
                "review_posted_date": "12 Feb 2018",
                "review_header": "THE Lego Set!",
                "review_rating": "5.0 ",
                "review_author": "G. Wolff"
            },
            {
                "review_comment_count": "",
                "review_text": "I was always regretting not purchasing the first Ultimate Lego Millennium Falcon (>5000 pieces and $500) but I was thrilled when I heard Lego creating an upgraded version of it and I promised myself that I wouldn't miss this one. This kit is huge. It took my 3 boys and me over 18 days to complete it on a part-time basis. We took out time building it because we enjoy the entire build process. It is pretty cool the way it's designed. It has a Techniques internal frame and the armor plates rest on top of the frame. I wish they designed the armor plates to attach to the frame to make it a stress bearing piece and adding to the overall rigidity of the model but alas they did not. When you finally place all the armor on top of the frame it will cause the frame to flex hence you cannot just pick up the model but you will have to carry it a certain way if you want to move it. Of course I'm just nit-picking, make no mistake this is an awesome model and an engineering miracle. I love it and it's totally worth it.",
                "review_posted_date": "24 May 2018",
                "review_header": "Take you time building it and make sure you place the pieces correctly...it's hard retracing your steps...there are over 1300.",
                "review_rating": "5.0 ",
                "review_author": "Vicente D. Lerum"
            },
            {
                "review_comment_count": "",
                "review_text": "It was much bigger than I thought it was despite knowing how many pieces there were. I ended up working on it for about an hour each day after work and it's been a ton of fun. There are so many small details that just haven't existed on this level before on Legos and while I had been a bit hesitant to spend the money on this at first, I can say that it was more than worth it. There is a sense of pride and accomplishment to seeing it slowly take shape and when it's finally done, it's almost sad because the work is over. Can't wait for the next Ultimate Star Wars Lego set. Gonna be bigger and better!",
                "review_posted_date": "28 Apr 2018",
                "review_header": "A worthy use of time",
                "review_rating": "5.0 ",
                "review_author": "Sean"
            },
            {
                "review_comment_count": "",
                "review_text": "Great set. Really impressive amount of detail and presentation. You can really tell artists created it and that there was true passion behind the project. I bought it to take a break from technology, computer and phone screens all day. It's a great emotional relief. It makes me focus on a task instead of stressing about day-to-day troubles at work or home.",
                "review_posted_date": "27 May 2018",
                "review_header": "Great craftsmanship and wonderful distraction.",
                "review_rating": "5.0 ",
                "review_author": "kajunkerspunk"
            },
            {
                "review_comment_count": "",
                "review_text": "For anticipation, fun, family time and shear WOW factor, this product gets a 5 of 5 ! ! ! Since we all love it, why a 4 of 5 then? The interior/floor plan of this is not complete or consistent with the movie layout. Getting into the few usable spaces is also not so user-friendly. The design is not really solid, so it can't easily be picked up – pretty much just for looking. That said, we still love it!",
                "review_posted_date": "10 Aug 2018",
                "review_header": "Love love love this!",
                "review_rating": "4.0 ",
                "review_author": "Quill"
            }
        ],
        "url": "http://www.amazon.com/dp/B075SDMMMV\n"
    },
    {
        "name": "LEGO Marvel Super Heroes Avengers: Infinity War Sanctum Sanctorum Showdown 76108 Building Kit (1004 Piece)",
        "price": "$82.99",
        "ratings": {
            "5 star": "95%",
            "3 star": "3%",
            "2 star": "2%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "it is one of the most detailed Lego marvel super hero sets i have ever seen only comparing to the 76057 spider-man bridge battle in the sheer amount of detail in the bricks and the sanctum now as with all the Achilles there is always a heel when this got revealed i thought it would look great next to my creator modular buildings but it does not connect which is understandable but it has no sidewalk which is a must if you want to display it next to the modular buildings but you can always buy a base plate and some tiles similar to the modular buildings and it blends in and its a creative idea to make it fold up for easy storage / mobility kids can take it from house to house easily and all the figures can be stored inside so it can fold up also you can always build a handle so you can carry it like a suitcase well that's all i have to say today so yeah definitely one of the bests",
                "review_posted_date": "02 May 2018",
                "review_header": "The sheer amount of detail is amazing",
                "review_rating": "5.0 ",
                "review_author": "AwesomeGuy9011"
            },
            {
                "review_comment_count": "",
                "review_text": "Love this set!There are so many places to act out scenes from the movie and attach your favorite characters all around Dr. Strange's place. Our 10 year old hasn't out this away since receiving it in June for his birthday. Lots of imaginitive play going on here!",
                "review_posted_date": "26 Jul 2018",
                "review_header": "Love this set",
                "review_rating": "5.0 ",
                "review_author": "Maureen Struss"
            },
            {
                "review_comment_count": "",
                "review_text": "Perfect for a Lego crazy person, kept my kid off electronics and busy for several hours.. has some features he enjoyed",
                "review_posted_date": "15 May 2018",
                "review_header": "Perfect for a Lego crazy person",
                "review_rating": "5.0 ",
                "review_author": "Value For dollars Spent Shopper"
            },
            {
                "review_comment_count": "",
                "review_text": "I got this set for my son because he loves legos. He could not stope building it. The set is overall amazing and fun to play with. I recommend it to any child who loves LEGOs.",
                "review_posted_date": "15 May 2018",
                "review_header": "MY SON LOVES IT! GREAT PURCHASE",
                "review_rating": "5.0 ",
                "review_author": "KMB"
            },
            {
                "review_comment_count": "",
                "review_text": "Love it!",
                "review_posted_date": "07 Apr 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "Christine Basile"
            },
            {
                "review_comment_count": "",
                "review_text": "Great price for how big this set feels. My son had fun with the build and we both loved how the final model turned out. He especially liked the hidden panels and breakaway walls and rope/web feature. He asked me to keep it in our display case when not being played with so that it won’t get “messed up”. That means it’s a keeper...for now at least. Also some nice minifigs. Really great set highly recommended.",
                "review_posted_date": "31 Oct 2018",
                "review_header": "Fantastic Set for 8 yr old",
                "review_rating": "5.0 ",
                "review_author": "Novacaine"
            },
            {
                "review_comment_count": "",
                "review_text": "Bought this set for my son, he didnt have the patience to out it together, he only wanted to play with it....but I had fun putting it together and it only took about 2-3 hours to do. The set has trap doors, levers, and interactive pieces to make the set more fun to play with....my 5 year old son loves this set",
                "review_posted_date": "26 Oct 2018",
                "review_header": "Awesome set",
                "review_rating": "5.0 ",
                "review_author": "Cody S."
            },
            {
                "review_comment_count": "",
                "review_text": "Fantastic build. Was so fun to put together and super cute too.",
                "review_posted_date": "11 Apr 2018",
                "review_header": "Fun build!",
                "review_rating": "5.0 ",
                "review_author": "Germanny"
            }
        ],
        "url": "http://www.amazon.com/dp/B077TFTR8B\n"
    },
    {
        "name": "LEGO Marvel Super Heroes Avengers: Infinity War The Hulkbuster Smash-Up 76104 Building Kit (375 Piece)",
        "price": "$23.99",
        "ratings": {
            "5 star": "84%",
            "4 star": "10%",
            "3 star": "2%",
            "2 star": "1%",
            "1 star": "3%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Its is the best mech build i have seen in a long time and the turret is a bonus i mean the only flaw's would have to be bruce banner i mean it looks nothing like the movie it more resembles peter parker or comic book bruce banner and there are so many stickers i mean like so many tons but if you have mastered the sticker placing art then it should be fine so yeah 4/5",
                "review_posted_date": "03 May 2018",
                "review_header": "SO MANY STICKERS",
                "review_rating": "4.0 ",
                "review_author": "AwesomeGuy9011"
            },
            {
                "review_comment_count": "",
                "review_text": "My grandson is 7 years old and he loves legos. He wanted this one so I got it. It didn’t take him but 2 days to put it togetherness. He loved it!!!",
                "review_posted_date": "24 May 2018",
                "review_header": "Grandson loves it",
                "review_rating": "5.0 ",
                "review_author": "marie a montalbano"
            },
            {
                "review_comment_count": "",
                "review_text": "My son is a huge hulbuster fan! He loves this set !",
                "review_posted_date": "20 Mar 2018",
                "review_header": "Five Stars",
                "review_rating": "5.0 ",
                "review_author": "sarah romero"
            },
            {
                "review_comment_count": "",
                "review_text": "I ordered this because my sister told me it's one of the things my nephew wanted for Christmas. me, when I was his age I loved playing with LEGOs, mostly for the building of the sets. my just loves playing with them AFTER someone else has put it together. he should love this set and I can't wait to see his face on Christmas when he opens it.",
                "review_posted_date": "06 Dec 2018",
                "review_header": "christmas gift for my nephew",
                "review_rating": "4.0 ",
                "review_author": "daryl drumheller"
            },
            {
                "review_comment_count": "",
                "review_text": "This set is just as advertised. It is nice to be surprised at the size of a lego set every now and then. However this time I was not surprised at its size but rather its bulkyness, very imperssive set. My one complaint is that it's shoulder pads pop off very easily when it's arms are posed over its head. But other than that this set is very sturdy.",
                "review_posted_date": "30 Jul 2018",
                "review_header": "Great Job As Always Lego!",
                "review_rating": "4.0 ",
                "review_author": "SomeDude"
            },
            {
                "review_comment_count": "",
                "review_text": "This set was a huge hit for my Marvel-loving son’s 6th birthday. He’s not much of a builder so his older brother helped with assembly, but he loves the figure and all the features. He has carried it all over the house for the past month plus.",
                "review_posted_date": "20 Oct 2018",
                "review_header": "Really fun set",
                "review_rating": "5.0 ",
                "review_author": "mindy_marvelmom"
            },
            {
                "review_comment_count": "",
                "review_text": "Great set! Price: I bought it at the typical 20% off as most amazon lego purchases should be buying for at the minimum. 5/5 for the price even though at the time I purchased it, it was new. Quality: 4/5. The set includes some weird cannon proxima controls which... spoiler alert... never even happens in the movie. Comes with some quality minifigures though. I wouldn't buy more than one, but definitely a must have.",
                "review_posted_date": "09 May 2018",
                "review_header": "Price quality review",
                "review_rating": "4.0 ",
                "review_author": "Mar2ne"
            },
            {
                "review_comment_count": "",
                "review_text": "We were so excited when we ordered for my son's birthday. He just started putting it together and pieces are missing, which is heartbreaking for a child. Of course they aren't normal pieces we can steal from other sets either. It may be just us though and a bad break.",
                "review_posted_date": "20 Sep 2018",
                "review_header": "Missing pieces",
                "review_rating": "2.0 ",
                "review_author": "Amazon Customer"
            }
        ],
        "url": "http://www.amazon.com/dp/B078C8HZ1P\n"
    },
    {
        "name": "LEGO Marvel Super Heroes Avengers: Infinity War Thanos: Ultimate Battle 76107 Guardians of the Galaxy Starship Action Construction Toy and Building Kit for Kids (674 Piece)",
        "price": "$56.00",
        "ratings": {
            "5 star": "88%",
            "4 star": "7%",
            "3 star": "2%",
            "2 star": "1%",
            "1 star": "2%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "So excited to have this set, it's a must have if you have any of the other five Infinity War sets. It's worth buying from Amazon because it's cheaper than Target, Walmart, and the Lego store.",
                "review_posted_date": "03 Jun 2018",
                "review_header": "I completed the infinity gauntlet! 🍏🍎🍊🍋🍇💎",
                "review_rating": "5.0 ",
                "review_author": "Benjamin"
            },
            {
                "review_comment_count": "",
                "review_text": "Certainly a bit of a greedy move on Lego's part splitting up the set in that fashion, but ultimately this is still a great set and the complimentary set is not very expensive. To clarify there is a companion set that goes with this in an escape pod that fully completes the ship. Considering this set runs about $70 I can understand the frustration in having to spend another 20 to complete the ship 100%. But in fairness they have piece count to consider and this set includes 4 minifigures and an infinity gauntlet. Once complete it is much larger than I expected and once you get the extra set which I found at target for $15, the ship is simply brilliant and I am not that big of GOTG fan. Good set overall with some very unique minifigures.",
                "review_posted_date": "31 Jul 2018",
                "review_header": "Great set even if it not entirely complete.",
                "review_rating": "5.0 ",
                "review_author": "MrChamberlain"
            },
            {
                "review_comment_count": "",
                "review_text": "I got this lego for myself, I thought it would smaller but it was a lot bigger than expected. I love this lego I would totally buy it if I were you. I really like Thanos.",
                "review_posted_date": "10 Apr 2018",
                "review_header": "I love this lego I would totally buy it if I ...",
                "review_rating": "5.0 ",
                "review_author": "E. C. Brugger"
            },
            {
                "review_comment_count": "",
                "review_text": "I bought the kit “just” for Thanos and the infinity gauntlet, but ended up loving the whole thing. The ship is awesomely sturdy once put together and can be played with, with some care of course. The ship is quite large, 18” wing tip to wing tip and 13” front to back and took me the better part of the evening to assemble. The other figures are pretty cool to have also, especially Ironman. So happy with this purchase.",
                "review_posted_date": "25 Jun 2018",
                "review_header": "Love the step-by-step assembly and the whole kit.",
                "review_rating": "5.0 ",
                "review_author": "C.M."
            },
            {
                "review_comment_count": "",
                "review_text": "This Lego set was purchased for my grandson. He has been wanting this for months and loves it! The item arrived as described online and packaged well regarding the shipping.",
                "review_posted_date": "15 Jun 2018",
                "review_header": "This Lego set was purchased for my grandson. He ...",
                "review_rating": "5.0 ",
                "review_author": "James Fowler"
            },
            {
                "review_comment_count": "",
                "review_text": "luckily with this one no pieces were missing. we had another lego arriving with the same order. That one also had the seal broken and a bag was missing. Very frustrating.",
                "review_posted_date": "09 Nov 2018",
                "review_header": "seal was broken",
                "review_rating": "2.0 ",
                "review_author": "TG"
            },
            {
                "review_comment_count": "",
                "review_text": "My son was rewarded with the LEGO set after earning it. He is heartbroken that after a few hundred pieces of hard work and effort-we are missing all of the stickers.",
                "review_posted_date": "23 Aug 2018",
                "review_header": "Missing stickers",
                "review_rating": "3.0 ",
                "review_author": "CleverHound"
            },
            {
                "review_comment_count": "",
                "review_text": "Lots of fun. Lots of pieces. Took a couple of hours but turned out to epic looking when It was complete.",
                "review_posted_date": "26 May 2018",
                "review_header": "So much fun",
                "review_rating": "5.0 ",
                "review_author": "Kris Feeney"
            }
        ],
        "url": "http://www.amazon.com/dp/B078C9LXCM\n"
    },
    {
        "name": "LEGO Architecture Statue of Liberty 21042 Building Kit (1685 Piece)",
        "price": "$118.98",
        "ratings": {
            "5 star": "77%",
            "4 star": "14%",
            "1 star": "9%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "This is an absolutely beautiful architecture set. Some other builders have stated that they don’t like that there isn’t more detail in the face; I agree that it could look better to have some, but I don’t feel it detracts from the simple beauty of this set. I really enjoyed this one, as I build the architecture series of places that I (and/or my family) have seen. This one is different from the others in that it really gives height to the set, which allows for the folds of fabric in the statue to be seen and explored. Just a lot of fun to build, and I think this one will definitely get many comments. Kudos, LEGO !",
                "review_posted_date": "04 Jun 2018",
                "review_header": "Beautiful set in a really fun series.",
                "review_rating": "5.0 ",
                "review_author": "Jeremy C."
            },
            {
                "review_comment_count": "",
                "review_text": "I always thought that Lego bricks were for kids, but then I saw this Statue of Liberty kit and had to have it (I'm somewhat of a huge Statue of LIberty fan). I enjoyed making this kit -- the design is well thought-out, and the bricks mesh with eachother with a very satisfactory, almost sensual precision. I now understand what all the fuss is with Lego blocks. This won't be my last kit.",
                "review_posted_date": "28 Aug 2018",
                "review_header": "My first Lego kit",
                "review_rating": "5.0 ",
                "review_author": "SoCal guy"
            },
            {
                "review_comment_count": "",
                "review_text": "One of the best in the series. My only criticism is the lack of any detail in the face but the rest of it is fantastic. It is also much larger than expected and dwarfs most of the other sets",
                "review_posted_date": "09 Jun 2018",
                "review_header": "One of the best in the series",
                "review_rating": "5.0 ",
                "review_author": "Phil"
            },
            {
                "review_comment_count": "",
                "review_text": "Every home needs a little Lady Liberty....I managed to build this in a few days as I got caught up in the progress and watching it get closer to it's final construction. It's an impressive piece, and stands quite tall, so it will become a focal point of any room. I enjoyed the clear construction instructions, and only needs to pry apart errant pieces on a very rare occasion. It's a wonderful piece by LEGO, and I highly recommend it for Lego Enthusiasts.",
                "review_posted_date": "08 Nov 2018",
                "review_header": "I enjoyed the clear construction instructions",
                "review_rating": "5.0 ",
                "review_author": "M. Merritt"
            },
            {
                "review_comment_count": "",
                "review_text": "This is a good and surprisingly intricate build of the statue of liberty. That said, for the price I think there are better kits like the Saturn V, which is larger and much more impressive, and sturdier too. On the other hand, this isn't as tall and won't fall over easily, so it probably would be a better desk model.",
                "review_posted_date": "21 Sep 2018",
                "review_header": "fun build",
                "review_rating": "5.0 ",
                "review_author": "William"
            },
            {
                "review_comment_count": "",
                "review_text": "I had to order a couple of packages of small pieces when those came up short. Still, I would do it all again in a minute. You learn a lot doing Lady Liberty. Did you know about the broken chains at the Lady's feet? They are the last pieces you put on the model. They caused me to decide to read and learn more about her history.",
                "review_posted_date": "06 Nov 2018",
                "review_header": "Beautiful model with some pieces missing",
                "review_rating": "4.0 ",
                "review_author": "JAB"
            },
            {
                "review_comment_count": "",
                "review_text": "Lego shorted me three pieces. You can contact Lego and they will ship you missing pieces. I managed to find some in my extra pieces. One was not the part I needed but no one will notice but me.",
                "review_posted_date": "11 Oct 2018",
                "review_header": "nice build",
                "review_rating": "4.0 ",
                "review_author": "Patricia F Green"
            },
            {
                "review_comment_count": "",
                "review_text": "Absolutely perfect! I love it! It was a blast to build. Somewhere I screwed up and had to take the statue apart and rebuild (due to a missing part). I still couldn't find it, so I switched one 'unseen inner' for another, to compensate.",
                "review_posted_date": "10 Jul 2018",
                "review_header": "Absolutely perfect! I love it",
                "review_rating": "5.0 ",
                "review_author": "jdub39"
            }
        ],
        "url": "http://www.amazon.com/dp/B0793JTRKG\n"
    },
    {
        "ratings": {
            "5 star": "38%",
            "4 star": "3%",
            "3 star": "10%",
            "2 star": "14%",
            "1 star": "35%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "The APR starts at 16.99% and goes as high as 29.99%. This might be good for a small business starting out, but the terms are too high for me.",
                "review_posted_date": "28 Oct 2018",
                "review_header": "High APR",
                "review_rating": "3.0 ",
                "review_author": "Dan Lovejoy"
            },
            {
                "review_comment_count": "",
                "review_text": "Approved but what a small credit limit considering I get 5K on a average, I Just got 500.00? A little disappointing If i have to pay an annual fee.",
                "review_posted_date": "27 Oct 2018",
                "review_header": "Approved but with a small credit limit 500.00 - My average credit limit is 6k. Disappointed",
                "review_rating": "3.0 ",
                "review_author": "Sam"
            },
            {
                "review_comment_count": "",
                "review_text": "Amex slammed my account with the Pay over time program shut it down and sued me. Wtf? Watch out Amex does not have your business in mind.",
                "review_posted_date": "25 Oct 2018",
                "review_header": "Amex will sue you personally",
                "review_rating": "1.0 ",
                "review_author": "John Keister"
            },
            {
                "review_comment_count": "",
                "review_text": "I have spent 38 years trying to get AMEX credit and be it $500 or $5000, I am happy to be approved. I already had the Chase Visa with $9500 credit but the APR was too high....Its been paid off and now Ill switch my Amazon Credit decisions that aren't Debit to AMEX and build a great history with them.... Plus the card is pretty spiffy or so I think!",
                "review_posted_date": "29 Oct 2018",
                "review_header": "So the Interest is Higher, This is a card for middle of the road credit.",
                "review_rating": "5.0 ",
                "review_author": "The Device Medics"
            },
            {
                "review_comment_count": "",
                "review_text": "PR not available on the states list. Please fix this.",
                "review_posted_date": "24 Oct 2018",
                "review_header": "PR not available on the states list",
                "review_rating": "1.0 ",
                "review_author": "Ruu"
            },
            {
                "review_comment_count": "",
                "review_text": "less than 3 minutes... Fantastic way to apply from mobile device. Thank you amazon !!!",
                "review_posted_date": "26 Oct 2018",
                "review_header": "An instant application process",
                "review_rating": "5.0 ",
                "review_author": "POLEPOSITION USA"
            },
            {
                "review_comment_count": "",
                "review_text": "I love this card as a backup card. I am very pleased with the customer service department. I got my card fast and it was confirmed fast. As with any credit card, just watch you spending habits. Amazon is always taking things to the next level!",
                "review_posted_date": "01 Nov 2018",
                "review_header": "Another Great Card For My Cache",
                "review_rating": "5.0 ",
                "review_author": "Mistress Susan TV"
            },
            {
                "review_comment_count": "",
                "review_text": "Pressed the submit button and nothing happened? Don't know if went through or not! Not going to fill it out all again!",
                "review_posted_date": "01 Nov 2018",
                "review_header": "NEW AMAZON AMERICAN EXPRESS CARD",
                "review_rating": "1.0 ",
                "review_author": "cmw"
            }
        ],
        "url": "http://www.amazon.com/dp/B07984JN3L\n"
    },
    {
        "name": "LEGO Friends Heartlake City Resort 41347 Top Hotel Building Blocks Kit for Kids, Popular and Fun Toy Set for Girls (1017 Piece)",
        "price": "$99.95",
        "ratings": {
            "5 star": "86%",
            "4 star": "11%",
            "3 star": "3%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "These were gifts for my great-grandchildren who live in Oregon. I ordered them from this coast and they arrived on the west coast and the two children were thrilled with the gifts they wanted.",
                "review_posted_date": "23 Sep 2018",
                "review_header": "Amazon is so dependable...",
                "review_rating": "5.0 ",
                "review_author": "Barbara"
            },
            {
                "review_comment_count": "",
                "review_text": "They love their legos",
                "review_posted_date": "05 Nov 2018",
                "review_header": "lego love",
                "review_rating": "5.0 ",
                "review_author": "Tracy L. Reiss"
            },
            {
                "review_comment_count": "",
                "review_text": "My daughter loved building this one",
                "review_posted_date": "15 Nov 2018",
                "review_header": "Awesome set",
                "review_rating": "5.0 ",
                "review_author": "Darwin R. Cook"
            },
            {
                "review_comment_count": "",
                "review_text": "Got this for our 9 year old daughter, whose enjoyment of Lego sets varies widely depending upon their themes and designs, and she absolutely loves it. I think it is because of the very whimsical, colorful, and fun design. Builders get to construct a resort hotel with lots of amenities: front desk, juice bar, rooftop party station with turntable, rooms & furnishings, etc. Then there's the water park side with two slides, big bucket, lifeguard station, jet-ski, parasailing, and windsurfing. And connecting the hotel & water park is the very nifty working monorail. With four friends figures, tons of bright colorful pieces (over a thousand), and plenty of playable elements, this is a set that provides plenty of building fun and a lot of lasting play value. We've had no small number of Lego sets over the years from many different Lego themes (Classic, City, Batgirl, and even one other Friends set) , but my daughter has liked this one the best. A big hit!",
                "review_posted_date": "25 Aug 2018",
                "review_header": "9 Year Old Daughter LOVES It",
                "review_rating": "5.0 ",
                "review_author": "Doggymcnuggets"
            },
            {
                "review_comment_count": "",
                "review_text": "Lego Friends: Heartlake City Resort contains 1,017 pieces. There are 7 numbered bags and 2 additional bags for the slides, large plates, and the monorail tracks. There is 1 sticker sheet with over 20 stickers. This set is aimed towards girls 7-12. Instead of normal Lego minifigs, there are four mini-doll figures. Once finished, the resort has plenty of play details, with the monorail, slides, and various shops. This set isn’t overly sturdy; if you want to move it after construction, I recommend having an adult do it. The monorail track fell off when I tried to move mine. Easy enough to fix, but it might be disappointing for kids to see. Perhaps my expectations (and preferences) are high, considering I normally construct Star Wars, Harry Potter, Ideas, and Architecture sets. I didn’t find Heartlake City Resort a particularly enjoyable build. It’s easy and repetitive. If I were to buy a set for a gift, I’d want it to demonstrate different building techniques or at least be fun to construct. I also didn’t like the large number of stickers. In some sets, you can skip applying the stickers and not lose appeal, but I think they’re necessary here, especially to add some pizzazz to all the white.",
                "review_posted_date": "13 Sep 2018",
                "review_header": "LEGO Friends Heartlake City Resort 41347",
                "review_rating": "3.0 ",
                "review_author": "Leeanna Chetsko"
            },
            {
                "review_comment_count": "",
                "review_text": "Holey moley this is a big one. There’s 1017 pieces, 26 stickers, 7 big numbered bags of pieces, 4 friends, 2 slides, and a dolphin… and a monorail, among a bunch of other little accessories (tacos and pizzas and a parasail!). It took a few hours to assemble. There are separate buildings but they all connect together, and the monorail tracks also connect to whichever two buildings you put on the ends. The friends are not your standard LEGO brick people minifigs - they’re “mini dolls”. Their feet still connect to a standard LEGO ground but otherwise they dolls are shaped really differently. You end up with a dollhouse-style resort with dolls, all of which happen to be plastic bricks (or brick-like) and connect together. The resort is really big! I’m really impressed with what you get in this set.",
                "review_posted_date": "18 Aug 2018",
                "review_header": "Whoa, this is an impressively big set!",
                "review_rating": "5.0 ",
                "review_author": "Risa"
            },
            {
                "review_comment_count": "",
                "review_text": "We gave this set to our daughter for her 10th birthday and she says it gets 5 stars. This is by far the largest set that she has built with 7 labeled bags of pieces and a thick instruction book. She went right to work and had so much fun putting everything together. I love that different units came in different bags so we could get her to take a break when a section was completed. She built the entire thing herself with help only a couple of times to help her find small pieces that got dropped into the carpet in her room. Now that it is complete, she and her sister have fun with all the characters. Legos are fantastic for combining building skills, direction following, fine motor skills (some of the pieces are tiny!), and imaginative play.",
                "review_posted_date": "24 Oct 2018",
                "review_header": "Hours of entertainment",
                "review_rating": "5.0 ",
                "review_author": "Library Girl Reads"
            },
            {
                "review_comment_count": "",
                "review_text": "My eight-year-old daughter is a big fan of LEGO Friends, so this set was a no-brainer. She also enjoys vacations. Put the two together and you get this set. There's a monorail, emphasis on the word \"mono\" as the rail only fits one LEGO friend and it goes around in circles. A little more exciting are the water slides with a \"splash bucket\" full of clear blue LEGO pieces. The set includes four figures, including a rare boy. The figures can be mixed and matched, although their skin color and gender limits this somewhat. Even more exciting than a male figure is the inclusion of a dolphin! Technically, this is a hotel, but there's only two places to sleep, which brings up some interesting questions as to who stays where. There's a telephone (really?), computer, juice bar, and the all-important roof terrace with DJ decks. There's also changing rooms and a restaurant, but the action is really out on the water: a water scooter with detachable parasailer, windsurf boar, and lifeguard stand. There's plenty of tiny pieces to play with (and lose) too. Everything you would expect for a resort is here, including bowls, cups, hot dogs, fruit, ice cream, keys, luggage and even a walkie-talkie. This set is more focused on experiences than reproducing a structure, and given that the water is mostly implied (with the exception of that splash bucket), it really opens up the set. If your child likes LEGO and vacations (who doesn't), this set is worth the investment.",
                "review_posted_date": "22 Oct 2018",
                "review_header": "Do you like vacations and friends?",
                "review_rating": "4.0 ",
                "review_author": "Michael J. Tresca"
            }
        ],
        "url": "http://www.amazon.com/dp/B07BJ57QT6\n"
    },
    {
        "name": "LEGO 6212644 Harry Potter Hogwarts Great Hall 75954 Building Kit and Magic Castle Toy (878 Piece)",
        "price": "$99.95",
        "ratings": {
            "5 star": "89%",
            "4 star": "5%",
            "3 star": "2%",
            "1 star": "4%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "It is not exactly the entire Hogwarts castle; however, it is a must for Harry Potter LEGO fan like me to have this set. It is very beautiful architecture like a cathedral. The mini figures are a must also like Professor McGonagall, Quirrel, Hagrid, Nearly headless Nick, Susan Bones etc. I also like the Phoenix. The basilisk, although short, but it’s good enough. I like scabbers and Hedwig, but I don’t see Crookshanks so I got a Hermione w/ Crookshanks mini figure. The price is a bit high. Overall, I love it and I am thinking of getting the train set next time.",
                "review_posted_date": "22 Aug 2018",
                "review_header": "Hogwarts Great Hall - Great set indeed",
                "review_rating": "5.0 ",
                "review_author": "StanleyMeow"
            },
            {
                "review_comment_count": "",
                "review_text": "This set was fun to build, and pretty straight-forward too. The pictures-only manual only led me astray once (the strangely fiddly hinges for the top of the tower, that didn't seem to line up at first...), and it's strangely addictive, as some parts were mystifying while being put together, and only made sense once you actually put them into the rest of the model. I did have a couple of minor niggles: I was missing a piece! A single, one-piece block, that appeared in the instructions, but was absent from the set. It was for the base of one of the buttresses on the outside of the hall, and while I ended up with a couple of pieces among the extras I could have used, I didn't know at the time if they were needed for something else! There was another case of one of the pieces being a different color than the manual indicated, but that was it, apart from that, it all went together pretty nicely. The finished model is wonderful, even if not all the bits seem built entirely to the same scale. The inclusion of 10 mini-figures means you can recreate most scenes from the films, even if getting Quirrel, but not Snape seems a bit odd. It's a little disappointing that there's only room for two of the four house banners to be hung up (though both are double-sided, so you can pick which ones you want to display), and it's not easy to reach inside the Hall once it's put together to get figures into it, but littler builders with smaller hands will have no problems. Overall, a fun set to build, and display. My only real complaint was that I wish it was bigger, and more complete version of the Hogwarts Castle, but I'm not a Lego fanatic, so I could have missed that, or maybe it's coming in the future?",
                "review_posted_date": "02 Sep 2018",
                "review_header": "Fun to build, and nicely detailed!",
                "review_rating": "5.0 ",
                "review_author": "stuart1776"
            },
            {
                "review_comment_count": "",
                "review_text": "Nothing wrong with Legos, but the box was beat up because of insufficient packaging. This is disappointing if you receive an item that you want to gift and it looks as if it's been through a hurricane or worse",
                "review_posted_date": "20 Oct 2018",
                "review_header": "Poor packaging",
                "review_rating": "3.0 ",
                "review_author": "Lenie S."
            },
            {
                "review_comment_count": "",
                "review_text": "Our 4 year old son loves legos but he is drawn to the older in age sets such as this one. I end up building these sets and this was the largest I've assembled to date. I appreciate how each step was broken down into bite size steps and it didn't feel overwhelming. The next biggest I've done, Lego Batman Batmobile, was a real chore and maybe 100-200 less pieces. The instructions were almost flawless and we put in around 4 hours plus breaks and lunch from start till finish. Super cool and super fun as well! Excellent value with everything you recieve as well!",
                "review_posted_date": "26 Aug 2018",
                "review_header": "For once it was fun to assemble!",
                "review_rating": "5.0 ",
                "review_author": "Rob Goblin"
            },
            {
                "review_comment_count": "",
                "review_text": "This was my first Lego set. I liked the subject, so that was fun. I had mixed impressions of the instructions. I liked the wordless, illustrated, step-by-step aspect, and they certainly got me there in the end. I think the instructions would be better if they somehow highlighted or pointed out the pieces featured in all the steps rather than some. Also, the order of the steps was a bit frustrating, jumping around to add a bit to each feature here and there. Overall, the set was fun, and I would definitely buy it again. While I might not assemble it again, I have young friends queued up for a turn.",
                "review_posted_date": "23 Nov 2018",
                "review_header": "Fun and appealing",
                "review_rating": "5.0 ",
                "review_author": "memery"
            },
            {
                "review_comment_count": "",
                "review_text": "My daughter asked me to buy this for her and she was super excited when it arrived. She put it together in one night by herself and the castle itself is beautiful to the eyes.",
                "review_posted_date": "20 Sep 2018",
                "review_header": "My 10 year old loves this",
                "review_rating": "5.0 ",
                "review_author": "Maria"
            },
            {
                "review_comment_count": "",
                "review_text": "Incredible detail. My ten year old was in heaven building this. He is a huge potter head and this hit the nail on the head. Love the way you can see inside and view each individual room. Worked great adding onto the amping willow set as well. Nice work LEGO",
                "review_posted_date": "19 Oct 2018",
                "review_header": "Perfecto",
                "review_rating": "5.0 ",
                "review_author": "CB Jack"
            },
            {
                "review_comment_count": "",
                "review_text": "Got this for 12-year old fan of lego and Harry Potter. He loves it.",
                "review_posted_date": "15 Sep 2018",
                "review_header": "Fun for Lego/Harry Potter fan",
                "review_rating": "5.0 ",
                "review_author": "LucyA"
            }
        ],
        "url": "http://www.amazon.com/dp/B07BKPKT2X\n"
    },
    {
        "name": "LEGO Harry Potter and the Chamber of Secrets Hogwarts Whomping Willow 75953 Building Kit (753 Pieces)",
        "price": "$62.99",
        "ratings": {
            "5 star": "93%",
            "4 star": "5%",
            "1 star": "2%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Great add on for the amazing great hall set. Too bad on the minifigures although, Hermione is one of three in this wave and Sheamus is just a plain default face. Hoping for some more ravenclaws and hufflepuffs in the future.",
                "review_posted_date": "23 Aug 2018",
                "review_header": "Great set",
                "review_rating": "5.0 ",
                "review_author": "Ben"
            },
            {
                "review_comment_count": "",
                "review_text": "We spent hours of fun to work together with our grandkids, 5 and 8 years old, of this Harry Potter set, we are planning to buy more Harry Potter LEGO sets. They are so nicely designed and including very easy to follow step by step instructions. After we finished we put them their bookshelf to display, they look very impressively beautiful! Highly recommend for Harry Potter LEGO fan and LEGO lovers!",
                "review_posted_date": "18 Sep 2018",
                "review_header": "Great Harry Potter LEGO set!",
                "review_rating": "5.0 ",
                "review_author": "CJ Wang"
            },
            {
                "review_comment_count": "",
                "review_text": "My son just watch all the movies in the summer and he is now a fan of harry potter series. So when i bought this for his birthday, he build it in just one day. He is happy. Everything came great and in mint condition.",
                "review_posted_date": "30 Oct 2018",
                "review_header": "As always Lego delivers",
                "review_rating": "5.0 ",
                "review_author": "@clixteammex"
            },
            {
                "review_comment_count": "",
                "review_text": "My 8 year old son built this in less than a day. He has it on display in his bedroom now. Cool set!",
                "review_posted_date": "27 Sep 2018",
                "review_header": "My 8 year old loved it!",
                "review_rating": "5.0 ",
                "review_author": "sara"
            },
            {
                "review_comment_count": "",
                "review_text": "This set is so true to the movies, it doesn’t fit with just one of them either there are characters from the first 2 movies. Very cool!",
                "review_posted_date": "31 Oct 2018",
                "review_header": "Love legos!",
                "review_rating": "5.0 ",
                "review_author": "Megan S."
            },
            {
                "review_comment_count": "",
                "review_text": "Ordered as a birthday gift for 8 yr old girl and she put it together in no time. She was so excited and had requested this lego item. I would buy it again if any one of the kids asked for it.",
                "review_posted_date": "17 Nov 2018",
                "review_header": "Best gift ever",
                "review_rating": "5.0 ",
                "review_author": "Kat E"
            },
            {
                "review_comment_count": "",
                "review_text": "Beautiful set and adds perfectly with the big castle. My ten year old loved building this. Quality work and detail for the potter heads out there.",
                "review_posted_date": "19 Oct 2018",
                "review_header": "Potter head",
                "review_rating": "5.0 ",
                "review_author": "CB Jack"
            },
            {
                "review_comment_count": "",
                "review_text": "My granddaughter was thrilled with this Lego set. She put it together along with the larger Hogwarts set and spent hours in happy play.",
                "review_posted_date": "14 Nov 2018",
                "review_header": "Great Lego set for Potter fans",
                "review_rating": "5.0 ",
                "review_author": "Cyd B."
            }
        ],
        "url": "http://www.amazon.com/dp/B07BKQQDJP\n"
    },
    {
        "name": "LEGO Technic Bugatti Chiron 42083 Race Car Building Kit and Engineering Toy, Adult Collectible Sports Car with Scale Model Engine (3599 Piece)",
        "price": "$349.95",
        "ratings": {
            "5 star": "85%",
            "4 star": "11%",
            "2 star": "4%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "Shout out to Lego for this stunningly-designed and manufactured Bugatti Chiron building kit. This incredible set with whopping 3,599 pieces is so sophisticated to a point where during four days of assembly, I was even able to learn the automobile production process and how each part works together to make a car fully functional. It is quite impressive to see that the complex mechanism can be recreated by building blocks. This beast is far beyond a level of toys and is really a good example of interdisciplinary efforts. The team at Lego has pushed their territory to another level unheard of, and their creativity and professionalism truly inspires and motivates me to do better for what I am doing.",
                "review_posted_date": "15 Sep 2018",
                "review_header": "I am so impressed by this amazing building set!",
                "review_rating": "5.0 ",
                "review_author": "MK"
            },
            {
                "review_comment_count": "",
                "review_text": "My son just turned 15 and he grew up building Legos, he is studying Engineering, when he got this Bugatti he got very excited it was a challenge a new record of 3,599 pieces for him to put together, when he open the box I can never forget his expression, he went through the boxes and the books, very detailed instructions (as every LEGO books), he couldn’t believe it, he said it was (by far) the best LEGO he was going to build, 7 days later with few hours here and there, he finished his master peace. Seeing him open every box and every bag turning the pages of the book to continue to build and his commitment to finish PRICELESS!!!!!!!!!, he says he might go for MECHANIC ENGINEERING.",
                "review_posted_date": "17 Sep 2018",
                "review_header": "A masterpiece.......",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "I'm a big Lego fan, and am no stranger to some of their more complex (ahem, expensive...) sets. I've built the Disney Castle, the Lego Sandcrawler, numerous technic and Star Wars models, etc. This set takes the cake- it's by far the most interesting but also challenging building experience in all of my years. The attention to detail is insane- it has an actual, functioning transmission, independent suspension, working all-wheel drive, a working W-16 engine where you can see each piston fire in the correct sequence when moving, etc. Some people may think that it's not realistic enough, or doesn't look like the real car enough- that's not the point. The point is that it's an amazing feat of Lego design, and is quite impressive when complete (it's big, too). I take my time when building, so I can't remember how many hours it took, but it was quite a few!",
                "review_posted_date": "02 Nov 2018",
                "review_header": "The most impressive Lego set I've ever built",
                "review_rating": "5.0 ",
                "review_author": "Matthieu P. Raillard"
            },
            {
                "review_comment_count": "",
                "review_text": "Just when I thought the guys at LEGO technic couldn’t out do themselves after the Porsche GTR, they go and hit a grandslam with this design. The attention to detail is mind boggling. The assembly process is simple, from a direction and assembly instructions, yet complex (You can easily miss a minute detail within a step, that can affect your overall build down the line). I can’t wait to see what they come up with next. Well done LEGO.",
                "review_posted_date": "16 Sep 2018",
                "review_header": "Wow!!!!!",
                "review_rating": "5.0 ",
                "review_author": "JP"
            },
            {
                "review_comment_count": "",
                "review_text": "This was a fun model to build (challenging too). It is heavy when completed. There was much attention to detail put into this kit.",
                "review_posted_date": "07 Nov 2018",
                "review_header": "Great fun building",
                "review_rating": "5.0 ",
                "review_author": "Erich Zann"
            },
            {
                "review_comment_count": "",
                "review_text": "This LEGO kit is amazing. The mechanics in it is what impressed me most. You’ll enjoy every moment when putting it together. In my set one important piece was missing, however LEGO sent it to me promptly. I’m totally satisfied with my purchase.",
                "review_posted_date": "04 Sep 2018",
                "review_header": "Several hours of fun!",
                "review_rating": "5.0 ",
                "review_author": "Marcus Mundim"
            },
            {
                "review_comment_count": "",
                "review_text": "Perfect details, still building it. Instructions are really clear, but it is a medium to high difficulty set",
                "review_posted_date": "05 Sep 2018",
                "review_header": "Totally worth it!!!!",
                "review_rating": "5.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "This is prob the best kit LEGO has made to date from the technic line. It’s also the most challenging build to date. With almost 900 pieces more then porsche 911 GT3 RS, this build will keep you engaged & entertained! Def worth the hefty retail price!",
                "review_posted_date": "15 Sep 2018",
                "review_header": "LEGO Technic Bugatti - Best LEGO set to date!",
                "review_rating": "5.0 ",
                "review_author": "BeastyFeast®"
            }
        ],
        "url": "http://www.amazon.com/dp/B07C8L9CRJ\n"
    },
    {
        "ratings": {
            "5 star": "62%",
            "4 star": "11%",
            "3 star": "11%",
            "2 star": "4%",
            "1 star": "12%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "The invoices are extremely confusing and when we go to pay it is for items we purchased a few months prior which normally isn't bad, but can be when we get to the end of the fiscal year. Also the first page tends to list more items then what the total payment due box says which is confusing. Only list on that page what has to be paid for. Lastly, for our account purposes we need the itemized invoice for what is being paid for in the current invoice. Currently I have to find the previous months invoice to get the itemized list so I can pay the current month's invoice. So in other words, the amount that is due should also have the itemized invoice in the following pages in addition to the other active charges. I can't pay for an item if I can't code it in our budget and I shouldn't have to flip between different invoices from different months to figure it out. Keep it simple. These are the only invoices I have ever seen created in such a convoluted way. Every other invoice I handle is clear about what is being paid for accept this one.",
                "review_posted_date": "13 Jun 2018",
                "review_header": "... we purchased a few months prior which normally isn't bad, but can be when we get to the ...",
                "review_rating": "3.0 ",
                "review_author": "Malvern Library"
            },
            {
                "review_comment_count": "",
                "review_text": "While the credit line is a convenience, the invoicing as it is handled by the third-party servicing provider is cumbersome to use. Product descriptions are truncated on the purchase detail provided. This makes it necessary for me to frequently take the extra step to research our purchases on our account in order to be able to code them. There is no total provided on the statement, again adding an extra step so I can be sure I am paying the correct amount. Since I opened the revolving credit line knowing it needed to be paid in full each month, I don't understand the point of checking off the boxes next to each purchase in order to be sure they are credited to the account. I feel with the sophisticated and impressive technology typically employed by Amazon, this style of invoicing is....inconsistent.",
                "review_posted_date": "13 Jun 2018",
                "review_header": "While the credit line is a convenience, the invoicing ...",
                "review_rating": "2.0 ",
                "review_author": "Dianne Tilton"
            },
            {
                "review_comment_count": "",
                "review_text": "Even though both my SS and DOB are correctly entered I kept getting the same below as encountered by other reviewers. Error message: \"Your response to following fields is invalid Date of Birth can not be less than 8 characters. Social Security Number can not be less than 9 characters.\"",
                "review_posted_date": "07 Aug 2018",
                "review_header": "Don't waste your time filling out the form!",
                "review_rating": "1.0 ",
                "review_author": "HJB Productions LLC"
            },
            {
                "review_comment_count": "",
                "review_text": "An absolute must for businesses, churches, etc. I pastor a small church which has a relatively low maximum on our business credit card. Amazon's corporate credit line gave me a very generous maximum credit line, allowed us to be sales tax exempt because we are a non-profit, and it is so simple to make a purchase. We can either use a P.O. Number or just our line of credit. A nicely detailed statement comes in the mail and I verify and approve it and turn it over to our treasurer/accountant for payment. I love it! Easiest way to purchase what we need, receive it with Amazon's always speedy shipment, and settle up when the statement comes in. If you have a church or business and don't have this you are missing out.",
                "review_posted_date": "11 Jun 2018",
                "review_header": "A nicely detailed statement comes in the mail and I verify ...",
                "review_rating": "5.0 ",
                "review_author": "Ted W. Smith"
            },
            {
                "review_comment_count": "",
                "review_text": "It's the easiest way to to have a business account associated with your personal account. This way you can pick and choose which account you want your purchase charged to. Only annoying thing is that the \"Corporate\" option will not show up as a payment option unless you choose the business address for delivery. I understand that's a security feature to protect against fraud but in our situation it's unnecessary and an annoyance. Other than that, no complaints.",
                "review_posted_date": "13 Jun 2018",
                "review_header": "Very good overall.",
                "review_rating": "5.0 ",
                "review_author": "Scarab"
            },
            {
                "review_comment_count": "",
                "review_text": "The site does not work I too am having problems all fields are correct. It comes back and says that SS need to be 9 numbers. Then it says that the Birthdate has to be at least 8 numbers. It does not show any errors but never able to complete the application online.",
                "review_posted_date": "20 Jul 2018",
                "review_header": "The Site does not Work",
                "review_rating": "1.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "I like the convenience of ordering things and paying in full. I do not like the way it is set up however. There is an order number when you order but on the credit card statement there is an invoice number and nothing to tie the two together except the amount and listed items. This makes it hard to reconcile the orders with the bill. It takes too much time to figure out. The billing seems to be lag behind quite a bit. We only pay bills once a month so it makes it difficult to make sure all invoices are paid. The statement doesn't reach us until after the deadline for our monthly bills.",
                "review_posted_date": "13 Jun 2018",
                "review_header": "love the convenience, BUT not the billing cycle",
                "review_rating": "3.0 ",
                "review_author": "Mjp"
            },
            {
                "review_comment_count": "",
                "review_text": "Wish there was a mechanism to have items categorized, such as book, video, video game, office supply, etc. Even if I could input that information when I ordered, it would help with my budget. As it is, I need to go through every invoice (lots) and try to determine which it is and then, if I can't remember, I need to look it up. It is essential to have this broken down for line items within our budget.",
                "review_posted_date": "13 Jun 2018",
                "review_header": "Would Give it 5 Stars, but....",
                "review_rating": "4.0 ",
                "review_author": "Nortlib"
            }
        ],
        "url": "http://www.amazon.com/dp/B07CBJQS16\n"
    },
    {
        "name": "LEGO 6213564 Star Wars Advent Christmas Countdown Calendar 75213 New 2018 Edition, Minifigures, Small Building Toys (307 Pieces), Multicolor",
        "ratings": {
            "5 star": "77%",
            "4 star": "2%",
            "3 star": "4%",
            "2 star": "4%",
            "1 star": "13%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I purchase this every year for my nephew & Oct. / Nov. kids gifts as it’s something fun for them to look forward to. They get so many toys that the parents appreciate a gift to open later. I have also used them as rewards for the kids as an incentive (good behavior/bringing home a complete work packet from school) even though they are Christmas themed the doors are numbered so you can use it anytime. Each day is individually wrapped so each build stays together until you are ready to build. Sometimes the pieces build on each other but they are all independent builds as well. Most of them are extremely simple and don’t take long to build but the anticipation each day is the real beauty of this calendar. I do feel like this set is more for boys. The Lego friends set is great for girls. It has more of the food and little animal figures which my daughter loved. Although the calendars are a little pricey, I feel like it is overall a good deal since the kids seem to enjoy each piece more than buying a larger set.",
                "review_posted_date": "09 Oct 2018",
                "review_header": "Great for a reward calendar anytime of year!",
                "review_rating": "5.0 ",
                "review_author": "Heather"
            },
            {
                "review_comment_count": "",
                "review_text": "Absolutely love this! This is my first year buying a Lego Advent Calendar for my son. We've been doing Lego's for quite some time now so I thought this would be prefect for our Advent calendar this year. Especially since my son loves all the Lego 'city' sets. I'm very happy with the sets inside, how big it is & how beautiful the outside packaging looks. It's gonna be hard keeping him out of it but he'll be very excited once December 1st comes. My husband & I will definitely be buying this again.",
                "review_posted_date": "24 Oct 2018",
                "review_header": "Amazing!",
                "review_rating": "5.0 ",
                "review_author": "Franchesca Vaca"
            },
            {
                "review_comment_count": "",
                "review_text": "What a disappointment. There is no Santa this year. I have purchased a Lego Advent calendar every year since they debuted, and it's been the Star Wars version ever since it came out. Only 1 other time do I recall there not being a Santa. I Back then I called and complained to Lego and the rep said that they were receiving a lot of complaints. I called again this year and the rep sent me a \"Santa\" to placate me. Well, it's a Santa body and hat but Geldolf hair. The Santa hat won't fit on the head. I'll be especially careful next year.",
                "review_posted_date": "07 Nov 2018",
                "review_header": "NO SANTA!",
                "review_rating": "2.0 ",
                "review_author": "Stacy L."
            },
            {
                "review_comment_count": "",
                "review_text": "This review is for the Friends calendar specifically. I wish the reviews weren't aggregated for all three sets. I get this advent calendar for my daughter every year. This is the first year I can recall (and I may be wrong) where it doesn't come with a minifig/Friend. Sure she has tons of minifigs that she can use with these things, but opening the minifig on day 1 and then using it with the rest of the set is one of her favorite parts. I suspect she's going to be a little disappointed. I am disappointed with LEGO's decision to not include a figurine in this set.",
                "review_posted_date": "30 Oct 2018",
                "review_header": "Friends set doesn't come with a minifig",
                "review_rating": "3.0 ",
                "review_author": "Jenny Penny"
            },
            {
                "review_comment_count": "",
                "review_text": "Bought this for my 8 year old. He loves his legos and I purchased him the Lego Movie Creator kit for Christmas this year so I thought this would be great for Christmas scenes and additional characters. We're only on day 3 but so far we are happy with it. Each \"door\" has a plastic bag with the pieces inside and instructions are shown on the inside of that door. He's built a rocketship, a man, and a car so far and he's anxious for the next day as soon as he's finished. I've read a lot of reviews by people who are serious lego collectors who were not happy with this set. These are people that know all of the different characters, pieces, etc. I am not that person. My kids love building and playing with them so my knowledge is limited to how much they enjoy them. I can tell you that this is a hit with them. I should also add that the character I showed in the pics has two faces, so they can choose which one shows.......\"happy go lucky face\" or \"oh boy\" face. My kids thought that was a cool feature.",
                "review_posted_date": "03 Dec 2018",
                "review_header": "Great!",
                "review_rating": "5.0 ",
                "review_author": "SPeery"
            },
            {
                "review_comment_count": "",
                "review_text": "We do Lego Advent calendars every year (for as long as I can remember). In keeping with the tradition, I gave our youngest her Advent Calendar this evening (Friends version) - boy was this a disappointment (for me more than her I think). The box was manufactured upside down, meaning when you open the \"flap\" on the front (ie: the play area), the entire calendar is upside down. It kind of defeats the purpose of having something you look at and look forward to opening daily. You know what I mean: You look forward to getting \"people\" and \"winter/seasonal\" things to play with each day. I've updated my initial review as I've communicated with Lego support. Apparently this is the \"new approach\" by Lego. Meaning take everything that you were used to in years past and just change it with the Friends set. I don't know if \"Friends\" cost more to make than bricks, but you won't find any \"Friends\" in this set. The idea of \"play\" also seems to be lost on this set as you are really just making ornaments. I order these in September so that I have them for the kids. I would have returned it, but of course I'm way outside of the return window. If you like the Friends sets from years past, you might be disappointed. Of course, if you want to make ornaments for the tree - you might love it! This really should just be called the Lego Ornament Set. You may have fun putting them together, but it is not at all like the sets of years past. I could live with that, except that it is marketed besides the other Advent Calendars and appears to be the only one to receive this new approach. Sorry - don't mean to be a HumBug - just not what we were expecting and clearly Lego had absolutely no intent of losing potential buyers by marketing the product for what it really is - \"NOT Lego Friends\".",
                "review_posted_date": "30 Nov 2018",
                "review_header": "Box Manufactured Wrong",
                "review_rating": "1.0 ",
                "review_author": "Chase Grisom"
            },
            {
                "review_comment_count": "",
                "review_text": "Super disappointed with this set. It’s my fault for not looking more closely at what was included, but unlike previous years this set does not include any of the friends and you don’t put together things to make a bigger scene. Each one is a Christmas tree decoration. It has nothing at all to do with LEGO Friends, except the picture on the box. I had looked carefully at many sets, but this one went on sale and I thought I had already looked at it. My mistake. But I definitely don’t recommend it, if you are looking for something related to LEGO Friends. Side note, I really wish amazon wouldn’t lump all the reviews together.",
                "review_posted_date": "01 Dec 2018",
                "review_header": "LEGO Friends 41353",
                "review_rating": "1.0 ",
                "review_author": "Michelle"
            }
        ],
        "url": "http://www.amazon.com/dp/B07D4C69GK\n"
    },
    {
        "name": "LEGO Star Wars Darth Vader’s Castle 75251 Building Kit (1060 Pieces) - (Amazon Exclusive)",
        "price": "$129.99",
        "ratings": {
            "5 star": "90%",
            "3 star": "10%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "It's the Christmas season, for goodness sake! Why would you ship a LEGO set without any outer covering or box and leave it on the porch. It was the first thing my grandson saw when he got home from school today, spoiling a Christmas surprise.",
                "review_posted_date": "28 Nov 2018",
                "review_header": "Shipping complaint",
                "review_rating": "5.0 ",
                "review_author": "amy"
            },
            {
                "review_comment_count": "",
                "review_text": "This comes in the retail packaging, it is not frustration free as described (must be an error). Awesome gift for a collector, LEGO enthusiast or Star Wars Fan. Its a big kit, just like one Santa may put under the tree. At over a thousand pieces with five Mini Figs including Bacta Tank (Darth Vader) this is a rarity and an exclusive kit. Both the Tie Advanced Fighter and Darth Vader's Castle are well designed allowing it for rougher play unlike some sets we have gotten in the past. Min Figs Included: Includes five minifigures 1 Darth Vader 1 Bacta Tank Darth Vader 2 Royal Guards 1 Imperial Transport Pilot.",
                "review_posted_date": "28 Nov 2018",
                "review_header": "Comes in Retail Packaging!",
                "review_rating": "5.0 ",
                "review_author": "StyleSnob"
            },
            {
                "review_comment_count": "",
                "review_text": "This is an awesome set for a younger LEGO-er. It is doable by a 9 year old, although if they're new to LEGO they may need some supervision and help. But the instructions are as clear as ever, the pieces are organized and can be found relatively quickly, and the whole set builds up into a very satisfying tower/playhouse. Build times will vary, but it took my 9 year old about a week of work, on and off. Once built, this set (unlike some others) offers a ton of play value to a young Star Wars fan, and it goes from being a STEM toy to being an imagination/creativity toy, as they use the minifigs, fighter plane, and tower to create imaginative stories. There are not a ton of moving parts (which any kid will tell you are the fun parts) but there are enough, and there are even working \"weapons\" on the fighter and the gunner on the turret. If I had any complaint it's that it's fairly monochromatic (so much gray and black), but my kid doesn't mind and that makes it more realistic. For the number of pieces included, I think this is a great deal and it's definitely a cool set for a 9-12 year old.",
                "review_posted_date": "03 Dec 2018",
                "review_header": "Very satisfying set for younger builder with great play value, too",
                "review_rating": "5.0 ",
                "review_author": "Unity Dienes"
            },
            {
                "review_comment_count": "",
                "review_text": "Anakin Skywalker, I found a loop of bacta required for the fixation of several components of the sort that would need it for trouble once made a mistake, but you can piece it. Just a warning to avoid from about a three hour diversion from being able to put this together. Netflix was on in the background, The Office, the episode where Michael eats a ton of pasta and then tries to run 5k for benefit of Merideth who had feline rabies. The part when he brakes, screen froze for a second and I had tie fighter parts everywhere. So it’s a good set. You would take from it the black pieces and might be some red - I would prepare for this in six ways: A) it’s ok. B) just slow down for a minute. 3) you can do this! 4) it will go together but less is less is sometimes more. 5) or less!! F) mission accomplished but not like when George said it when it wasn’t. My advice? Do it! Add to cart. Queue up Netflix. Ha ha, Stanley, ha ha!!",
                "review_posted_date": "28 Nov 2018",
                "review_header": "Do you like Legos?",
                "review_rating": "5.0 ",
                "review_author": "Vincent Spray-Tan"
            },
            {
                "review_comment_count": "",
                "review_text": "LEGO has done it again. What a great set for Star Wars fan and/or collector. It is a big kit with 1060 pieces, 5 mini figures and includes not only Darth Vader’s castle and a Tie Advanced Fighter. The five mini figures are Darth Vader, Bacta Tank Darth Vader, two Royal Guards and an Imperial Transport Pilot. It will be fun to build and play with, but the collector in the family wants to keep it boxed!",
                "review_posted_date": "30 Nov 2018",
                "review_header": "Another great LEGO set!",
                "review_rating": "5.0 ",
                "review_author": "grumpydan"
            },
            {
                "review_comment_count": "",
                "review_text": "I got this for my son in law, who is close to 30. He loves Star Wars, collectibles, and of course Legos! He probably had more fun putting this over 1000 piece Darth Vader Castle together than most kids! The figures make it all the more fun. Good instructions and everything fit like a charm!",
                "review_posted_date": "02 Dec 2018",
                "review_header": "Great fun for any Star Wars fans!",
                "review_rating": "5.0 ",
                "review_author": "Naomi Manygoats"
            },
            {
                "review_comment_count": "",
                "review_text": "A great build with over 1000 pieces. Definitely challenging but not overly so, even for kids. Any Star Wars LEGO fan will be thrilled with this, the mini figures are great as is Vader’s tie fighter.",
                "review_posted_date": "02 Dec 2018",
                "review_header": "A must for any Star Wars LEGO fan",
                "review_rating": "5.0 ",
                "review_author": "SR"
            },
            {
                "review_comment_count": "",
                "review_text": "Same problem here! I signed up for the discreet packaging options and it came In giant LEGO printed packaging. That’s hard to hide if your trying to surprise your child.",
                "review_posted_date": "29 Nov 2018",
                "review_header": "Packaging",
                "review_rating": "3.0 ",
                "review_author": "Robin Childress"
            }
        ],
        "url": "http://www.amazon.com/dp/B07J6F8H3M\n"
    }
]